{
  "id": 15259703,
  "name": "Toon World",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Continuous"
  },
  "Rulings": {
    "Edison": "●The 1000 Life Points needs to only be paid once when this card is activated. Paying 1000 Life Points is a cost.",
    "Tengu": "\n●The 1000 Life Points needs to only be paid once when this card is activated. Paying 1000 Life Points is a cost.",
    "Goat": "●The 1000 LP needs to only be paid once when this card is activated. Paying 1000 LP is a cost.Toon monsters may not attack the turn they are Special Summoned, regardless of how they are Special Summoned. \n●Toon monsters may not be Special Summoned from the GY unless they were Special Summoned properly first and the player performing the Special Summon has “Toon World” on the field. \n●If both players have “Toon World” on the field, if one “Toon World” is destroyed, all Toon monsters are destroyed. \n●If “Toon World” is sent to the GY, but not destroyed, Toon monsters are not destroyed.\n●Q: If you take control of your opponent’s Toon Monster during your turn after they have Special Summoned it to the field, can you attack with the Toon Monster? \nA: Yes you can, as long as the Toon monster was not Special Summoned during that same turn. \n●Q: If both players have “Toon World” and Toon Monsters on their side of the field and the opponent’s “Toon World” is destroyed, would all Toon Monsters be destroyed or only the opponent’s Toon Monsters? \nA: Both player's Toon monsters would be destroyed when a Toon World is destroyed. \n●Q: If a face-down “Toon World” is destroyed and sent to the GY, are Toon Monsters on the field also destroyed? \nA: All face-up Toon monsters would be destroyed because Toon World was destroyed. It does not matter if Toon World was face-up or face-down when it was destroyed. \n●Q: If I tribute “Toon World” for the effect of “Emergency Provisions,” is it considered destroyed thus destroying any Toons on the field, or mearly sent to the GY? \nA: “Emergency Provisions” merely sends cards to the GY, rather than destroying them. In this case, “Toon World” would not be considered destroyed, so your existing Toons on the field would be safe. You would, however, need “Toon World” on the field again if you wanted to Special Summon any new Toon monsters later on. \n●Steve Okegawa,  \n●Q: If I have Toons on the field and I use “Giant Trunade,” are my Toons destroyed? \nA: No, since “Toon World” was not destroyed.  12/10/03  \n●Q: If “Toon World” is on the field and an opponent plays “Imperial Order”, how exactly does that tie into paying 1000 LP? \nA: Imperial Order does NOT prevent you from using Toon World to Special Summon Toon Monster Cards. Also, you MUST pay 1000 LP to activate Toon World, even when Imperial Order is on the field. \n●Steve Okegawa, 01/22/04 \n●Q: Can Sheep Tokens be used as Tributes for Toon Monsters? \nA: Yes.",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "TeleDAD": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "Gladiator": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "ReturnDAD": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "Trooper": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "Circle": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "Stein": "● The 1000 LP needs to only be paid once when this card is activated.Paying 1000 LP is a cost.",
    "Base": "1. The 1000 Life Points needs to only be paid once when this card is activated. Paying 1000 Life Points is a cost."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "Activate this card by paying 1000 LP."
  }
}