{
  "id": 1596508,
  "name": "Dimension Fortress Weapon",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 1700,
    "def": 200,
    "level": 4,
    "race": "Machine",
    "attribute": "DARK"
  },
  "Rulings": {
    "Edison": "● Mandatory effects that send a card(s) from the deck to the GY will still activate.\n If the effect of \"Dimension Fortress Weapon\" is no longer applying when the milling would happen, they will still send cards from the deck to the GY  (e.g. vs \"Ryko, Lightsworn Hunter\").\nIf the effect of \"Dimension Fortress Weapon\" is still applying when the milling would happen, it will resolve without effect.\n● Optional effects that would send a card(s) from the deck to the GY cannot be activated (e.g. \"Foolish Burial\" / \"Future Fusion\").\n● Effects that send a card(s) from the deck to the GY as cost cannot be activated (e.g. \"Card Trooper\" / \"Celestia, Lightsworn Angel\").\n",
    "Tengu": "\n●Costs cannot be paid while “Dimension Fortress Weapon” is on the field, if the cost is to send cards from the Deck to the GY. So “Card Trooper” and “Celestia, Lightsworn Angel” cannot activate their effects.\n●In general, Lightsworn monsters can activate their effects while “Dimension Fortress Weapon” is on the field, but cards are not sent from the Deck to the GY afterwards.\n●If “Ryko, Lightsworn Hunter” is flipped face-up while “Dimension Fortress Weapon” is on the field, you can destroy 1 card with its effect, but no cards are sent from the Deck to the GY after that. “Solar Recharge” cannot be activated while “Dimension Fortress Weapon” is on the field.\n●If “Solar Recharge” is activated and “Dimension Fortress Weapon” is Summoned in a chain, draw 2 cards, but do not send 2 cards from the Deck to the GY after that.\n●If a card needs to be sent from the Deck to the GY because of a card combination that renders the usual resolution impossible, that card is still sent to the GY even if “Dimension Fortress Weapon” is on the field.\n●Example #1: If “Dimension Fortress Weapon” is on the field and you activate “Conscription”, and pick up a monster that could be Normal Summoned, but your Monster Card Zones are full, the monster is sent to the GY.\n●Example #2: The same is true for extra monsters from “Enchanting Fitting Room” that cannot be Summoned due to lack of available Monster Card Zones.\n●Example #3: “Crystal Seer” is flipped face-up while “Thunder King Rai-Oh” is on the field. “Reasoning” and “Monster Gate” cannot be activated while “Dimension Fortress Weapon” is on the field. If their effects were activated and “Dimension Fortress Weapon” was Summoned in a chain, their effects are not applied. “Null and Void” cannot be activated while “Dimension Fortress Weapon” is on the field.\n●If “Null and Void” is activated, and “Dimension Fortress Weapon” is Summoned in a chain, add the drawn cards to the hand after both players see them.\n●“Destiny Hero – Diamond Dude” cannot activate its effect while “Dimension Fortress Weapon” is on the field. If its effect is activated and “Dimension Fortress Weapon” is Summoned in a chain, the effect is not applied (do not check the top card of the Deck).\n●“Future Fusion” cannot be activated while “Dimension Fortress Weapon” is on the field. If “Future Fusion” is activated, and “Dimension Fortress Weapon” is Summoned in a chain, the effect of “Future Fusion” is not applied, no monsters are sent to the GY, no Fusion Monster is Special Summoned, and “Future Fusion” remains on the field meaninglessly.\n●If “Magical Merchant” is flipped face-up while “Dimension Fortress Weapon” is on the field, its effect is not applied.\n●If “Chain Destruction” is activated while “Dimension Fortress Weapon” is on the field, copies of the monster in the player’s hand are destroyed, but not copies in their Deck.\n●If “Spell Vanishing” is activated while “Dimension Fortress Weapon” is on the field, check the opponent’s hand and Deck, and send copies of the Spell Card in their hand to the GY, but not the copies from their Deck.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. Costs cannot be paid while \"Dimension Fortress Weapon\" is on the field, if the cost is to send cards from the Deck to the GY. So \"Card Trooper\" and \"Celestia, Lightsworn Angel\" cannot activate their effects.\\n2. In general, Lightsworn monsters can activate their effects while \"Dimension Fortress Weapon\" is on the field, but cards are not sent from the Deck to the GY afterwards.\\n3. If \"Ryko, Lightsworn Hunter\" is flipped face-up while \"Dimension Fortress Weapon\" is on the field, you can destroy 1 card with its effect, but no cards are sent from the Deck to the GY after that.\\n4. \"Solar Recharge\" cannot be activated while \"Dimension Fortress Weapon\" is on the field. If \"Solar Recharge\" is activated and \"Dimension Fortress Weapon\" is Summoned in a chain, draw 2 cards, but do not send 2 cards from the Deck to the GY after that.\\n5. If a card needs to be sent from the Deck to the GY because of a card combination that renders the usual resolution impossible, that card is still sent to the GY even if \"Dimension Fortress Weapon\" is on the field.\\n\\nExample #1: If \"Dimension Fortress Weapon\" is on the field and you activate \"Conscription\", and pick up a monster that could be Normal Summoned, but your Monster Card Zones are full, the monster is sent to the GY.\\n\\nExample #2: The same is true for extra monsters from \"Enchanting Fitting Room\" that cannot be Summoned due to lack of available Monster Card Zones.\\n\\nExample #3: \"Crystal Seer\" is flipped face-up while \"Thunder King Rai-Oh\" is on the field.\\n6. \"Reasoning\" and \"Monster Gate\" cannot be activated while \"Dimension Fortress Weapon\" is on the field. If their effects were activated and \"Dimension Fortress Weapon\" was Summoned in a chain, their effects are not applied.\\n7. \"Null and Void\" cannot be activated while \"Dimension Fortress Weapon\" is on the field. If \"Null and Void\" is activated, and \"Dimension Fortress Weapon\" is Summoned in a chain, add the drawn cards to the hand after both players see them.\\n8. \"Destiny HERO - Diamond Dude\" cannot activate its effect while \"Dimension Fortress Weapon\" is on the field. If its effect is activated and \"Dimension Fortress Weapon\" is Summoned in a chain, the effect is not applied (do not check the top card of the Deck).\\n9. \"Future Fusion\" cannot be activated while \"Dimension Fortress Weapon\" is on the field. If \"Future Fusion\" is activated, and \"Dimension Fortress Weapon\" is Summoned in a chain, the effect of \"Future Fusion\" is not applied, no monsters are sent to the GY, no Fusion Monster is Special Summoned, and \"Future Fusion\" remains on the field meaninglessly.\\n10. If \"Magical Merchant\" is flipped face-up while \"Dimension Fortress Weapon\" is on the field, its effect is not applied.\\n11. If \"Chain Destruction\" is activated while \"Dimension Fortress Weapon\" is on the field, copies of the monster in the player's hand are destroyed, but not copies in their Deck.\\n12. If \"Spell Vanishing\" is activated while \"Dimension Fortress Weapon\" is on the field, check the opponent's hand and Deck, and send copies of the Spell Card in their hand to the GY, but not the copies from their Deck."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}
