{
  "id": 16825874,
  "name": "Eccentric Boy",
  "Stats": {
    "type": "Tuner Monster",
    "frameType": "effect",
    "atk": 800,
    "def": 200,
    "level": 3,
    "race": "Spellcaster",
    "attribute": "WIND"
  },
  "Rulings": {
    "Edison": "●The Condition is not an effect and does not activate. It is not negated by Skill Drain.\n●This performs a Synchro Summon. The monster Summoned can be Special Summoned from the GY / removed from play area afterwards.\n●Correct Synchro Material Monsters must be used.\n●This can't be used to Summon Synchro Monsters requiring 2+ non-Tuners (like Mist Wurm).\n●The altered Level (by Cost Down) of the monster in hand is applied for the Synchro Summon.\n●If Beast of the Pharaoh was used and the Summon was not negated, its effect can activate.\n●If Tuningware is used, it can't be treated as a Level 2, but you can activate its effect to draw a card when the Synchro Monster is successfully Synchro Summoned.\n●The ●Example: If Colossal Fighter is destroyed by battle, and Imperial Iron Wall prevents it from being removed from play, its effect will activate in the GY and won't be negated.\n●If the Synchro Monster is flipped face-down, this effect no longer applies.\n●If the Synchro Monster is removed from play by Interdimensional Matter Transporter, it is treated as being removed from play by the effect of Eccentric Boy and remains removed from play.\n●VS. De-Synchro: if the Synchro Monster is not returned to the Extra Deck (because it was removed from play by the effect of Eccentric Boy), you can't Special Summon the Synchro Material Monsters.\n●VS. Urgent Tuning: you may perform the Synchro Summon using Eccentric Boy and a monster in your hand. If you don't have a monster in your hand which can be used as a Synchro Material Monster or you don't have a Synchro Monster in your Extra Deck which can be Special Summoned, then the opponent can check your hand and your Extra Deck to verify. You can't activate Urgent Tuning if you don't have a monster in your hand which can be used for a Synchro Summon.",
    "Tengu": "(C) When using this card as a Synchro Material Monster, the other Synchro Material Monster is 1 monster in your hand. (1) The Synchro Monster that used this card as a Synchro Material Monster cannot activate its effect, its effect(s) is negated, and it is removed from play when removed from the field.\n●The (C) Condition is not an effect and does not activate. It is not negated by Skill Drain.\n●This performs a Synchro Summon. The monster Summoned can be Special Summoned from the GY / removed from play area afterwards.\n●Correct Synchro Material Monsters must be used.\n●This cannot be used to Summon Synchro Monsters requiring 2+ non-Tuners (like Mist Wurm).\n●The altered Level (by Cost Down) of the monster in hand is applied for the Synchro Summon.\n●If Beast of the Pharaoh was used and the Summon was not negated, its effect can activate.\n●If Tuningware is used, it cannot be treated as a Level 2, but you can activate its effect to draw a card when the Synchro Monster is successfully Synchro Summoned.\n●The (1) Unclassified Effect applies as long as the Synchro Monster remains face-up on the field.\n●Example: If Colossal Fighter is destroyed by battle, and Imperial Iron Wall prevents it from being removed from play, its effect will activate in the GY and will not be negated.\n●If the Synchro Monster is flipped face-down, this effect no longer applies.\n●If the Synchro Monster is removed from play by Interdimensional Matter Transporter, it is treated as being removed from play by the effect of Eccentric Boy and remains removed from play.\n●VS. De-Synchro: if the Synchro Monster is not returned to the Extra Deck (because it was removed from play by the effect of Eccentric Boy), you cannot Special Summon the Synchro Material Monsters.\n●VS. Urgent Tuning: you may perform the Synchro Summon using Eccentric Boy and a monster in your hand. If you do not have a monster in your hand which can be used as a Synchro Material Monster or you do not have a Synchro Monster in your Extra Deck which can be Special Summoned, then the opponent can check your hand and your Extra Deck to verify. You cannot activate Urgent Tuning if you do not have a monster in your hand which can be used for a Synchro Summon.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg"
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}