{
  "id": 29947751,
  "name": "Morphtronic Magnen",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 800,
    "def": 800,
    "level": 3,
    "race": "Thunder",
    "attribute": "EARTH"
  },
  "Rulings": {
    "Edison": "●If you control an Attack Position Morphtronic Magnen and another monster, when your opponent attacks the other monster and and effect is activated that changes Morphtronic Magnen into Defense Position, the other monster is still attacked because it has already been selected as an attack target.\n●While Skill Drain is active, the Attack Position and Defense Position effects of Morphtronic Magnen can't be activated, because the While in Attack Position and While in Defense Position effects are negated.\n●If your opponent controls Command Knight and another monster with less ATK, your Morphtronic Magnen can't attack because it can't attack the Command Knight.\n●If your opponent controls a monster equipped with Ring of Magnetism and another monster with higher ATK, your Morphtronic Magnen must attack the monster equipped with Ring of Magnetism if it attacks.\n●If you control a Morphtronic Magnen equipped with Shooting Star Bow - Ceal and your opponent controls a face-up monster, your Morphtronic Magnen can only attack your opponent's monster. It can't attack directly.\n●If you control 2 or more Morphtronic Magnens in Defense Position, your opponent can't attack, unless they control a monster that can attack directly due to an effect.",
    "Tengu": "\n●If you control an Attack Position Morphtronic Magnen and another monster, when your opponent attacks the other monster and and effect is activated that changes Morphtronic Magnen into Defense Position, the other monster is still attacked because it has already been selected as an attack target.\n●While Skill Drain is active, the Attack Position and Defense Position effects of Morphtronic Magnen cannot be activated, because the While in Attack Position and While in Defense Position effects are negated.\n●If your opponent controls Command Knight and another monster with less ATK, your Morphtronic Magnen cannot attack because it cannot attack the Command Knight.\n●If your opponent controls a monster equipped with Ring of Magnetism and another monster with higher ATK, your Morphtronic Magnen must attack the monster equipped with Ring of Magnetism if it attacks.\n●If you control a Morphtronic Magnen equipped with Shooting Star Bow - Ceal and your opponent controls a face-up monster, your Morphtronic Magnen can only attack your opponent's monster. It cannot attack directly.\n●If you control 2 or more Morphtronic Magnens in Defense Position, your opponent cannot attack, unless they control a monster that can attack directly due to an effect.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● If you control an Attack Position 'Morphtronic Magnen' and another monster, when your opponent attacks the other monster and and effect is activated that changes 'Morphtronic Magnen' into Defense Position, the other monster is still attacked because it has already been selected as an attack target.\n● While 'Skill Drain' is applying, the Attack Position and Defense Position effects of 'Morphtronic Magnen' can't be activated, because the 'While in Attack Position' and 'While in Defense Position' effects are negated.\n● If your opponent controls 'Command Knight' and another monster with less ATK, your 'Morphtronic Magnen' can't attack because it can't attack the 'Command Knight'.\n● If your opponent controls a monster equipped with 'Ring of Magnetism' and another monster with higher ATK, your 'Morphtronic Magnen' must attack the monster equipped with 'Ring of Magnetism' if it attacks.\n● If you control a 'Morphtronic Magnen' equipped with 'Shooting Star Bow - Ceal' and your opponent controls a face-up monster, your 'Morphtronic Magnen' can only attack your opponent's monster. It can't attack directly.\n● If you control 2 or more 'Morphtronic Magnens' in Defense Position, your opponent can't attack, unless they control a monster that can attack directly due to an effect.",
    "TeleDAD": "● If you control an Attack Position 'Morphtronic Magnen' and another monster, when your opponent attacks the other monster and and effect is activated that changes 'Morphtronic Magnen' into Defense Position, the other monster is still attacked because it has already been selected as an attack target.\n● While 'Skill Drain' is applying, the Attack Position and Defense Position effects of 'Morphtronic Magnen' can't be activated, because the 'While in Attack Position' and 'While in Defense Position' effects are negated.\n● If your opponent controls 'Command Knight' and another monster with less ATK, your 'Morphtronic Magnen' can't attack because it can't attack the 'Command Knight'.\n● If your opponent controls a monster equipped with 'Ring of Magnetism' and another monster with higher ATK, your 'Morphtronic Magnen' must attack the monster equipped with 'Ring of Magnetism' if it attacks.\n● If you control a 'Morphtronic Magnen' equipped with 'Shooting Star Bow - Ceal' and your opponent controls a face-up monster, your 'Morphtronic Magnen' can only attack your opponent's monster. It can't attack directly.\n● If you control 2 or more 'Morphtronic Magnens' in Defense Position, your opponent can't attack, unless they control a monster that can attack directly due to an effect.",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. If you control an Attack Position \"Morphtronic Magnen\" and another monster, when your opponent attacks the other monster and and effect is activated that changes \"Morphtronic Magnen\" into Defense Position, the other monster is still attacked because it has already been selected as an attack target.\\n2. While \"Skill Drain\" is active, the Attack Position and Defense Position effects of \"Morphtronic Magnen\" cannot be activated, because the 'While in Attack Position' and 'While in Defense Position' effects are negated.\\n3. If your opponent controls \"Command Knight\" and another monster with less ATK, your \"Morphtronic Magnen\" cannot attack because it cannot attack the \"Command Knight\".\\n4. If your opponent controls a monster equipped with \"Ring of Magnetism\" and another monster with higher ATK, your \"Morphtronic Magnen\" must attack the monster equipped with \"Ring of Magnetism\" if it attacks.\\n5. If you control a \"Morphtronic Magnen\" equipped with \"Shooting Star Bow - Ceal\" and your opponent controls a face-up monster, your \"Morphtronic Magnen\" can only attack your opponent's monster. It cannot attack directly.\\n6. If you control 2 or more copies of \"Morphtronic Magnen\" in Defense Position, your opponent cannot attack, unless they control a monster that can attack directly due to an effect."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}