{
  "id": 33900648,
  "name": "Clear World",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Field"
  },
  "Rulings": {
    "Edison": "●If you control a monster with an effect that treats it as having multiple Attributes, all the relevant effects of “Clear World” will apply to you.\n●Even if “Field Barrier” is active, if you don’t pay the cost of “Clear World” during the End Phase it will be destroyed.\n●You still have to pay 500 Life Points to activate Spell Cards if you control a WIND monster, even if you also control “Spell Economics.” The WIND effect of “Clear World” only applies to activating Spell Cards. You don't pay Life Points when you activate the effect of a Spell Card that is already face-up on the field.\n●If you control “Clear Vice Dragon” and any EARTH, FIRE, or WATER monsters, the effect of “Clear World” will still start a Chain but it will resolve without effect.\n●The EARTH, FIRE, and WATER effects of “Clear World” each start their own Chain. You don't form a single Chain with all 3 effects.\n●The LIGHT, DARK, and WIND effects of “Clear World” don't start a Chain.",
    "Tengu": "\n●If you control a monster with an effect that treats it as having multiple Attributes, all the relevant effects of “Clear World” will apply to you.\n●Even if “Field Barrier” is active, if you don’t pay the cost of “Clear World” during the End Phase it will be destroyed.\n●You still have to pay 500 Life Points to activate Spell Cards if you control a WIND monster, even if you also control “Spell Economics.” The WIND effect of “Clear World” only applies to activating Spell Cards. You do not pay Life Points when you activate the effect of a Spell Card that is already face-up on the field.\n●If you control “Clear Vice Dragon” and any EARTH, FIRE, or WATER monsters, the effect of “Clear World” will still start a Chain but it will resolve without effect.\n●The EARTH, FIRE, and WATER effects of “Clear World” each start their own Chain. You do not form a single Chain with all 3 effects.\n●The LIGHT, DARK, and WIND effects of “Clear World” do not start a Chain.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. If you control a monster with an effect that treats it as having multiple Attributes, all the relevant effects of \"Clear World\" will apply to you.\\n2. Even if \"Field Barrier\" is active, if you don't pay the cost of \"Clear World\" during the End Phase it will be destroyed.\\n3. You still have to pay 500 Life Points to activate Spell Cards if you control a WIND monster, even if you also control \"Spell Economics\".\\n4. The WIND effect of \"Clear World\" only applies to activating Spell Cards. You do not pay Life Points when you activate the effect of a Spell Card that is already face-up on the field.\\n5. If you control \"Clear Vice Dragon\" and any EARTH, FIRE, or WATER monsters, the effect of \"Clear World\" will still start a Chain but it will resolve without effect.\\n6. The EARTH, FIRE, and WATER effects of \"Clear World\" each start their own Chain. You do not form a single Chain with all 3 effects.\\n7. The LIGHT, DARK, and WIND effects of \"Clear World\" do not start a Chain."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "During each of your End Phases, pay 500 Life Points or destroy this card. Each player receives effects, depending on the monster Attributes they control. ● LIGHT: Play with your hand revealed at all times. ● DARK: If you control 2 or more monsters, you cannot declare an attack. ● EARTH: During your Standby Phase: Target 1 face-up Defense Position monster you control; destroy that target. ● WATER: During your End Phase: Discard 1 card. ● FIRE: During your End Phase: Take 1000 damage. ● WIND: You must pay 500 Life Points to activate a Spell Card."
  }
}