{
  "id": 3773196,
  "name": "D.D. Scout Plane",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 800,
    "def": 1200,
    "level": 2,
    "race": "Machine",
    "attribute": "DARK"
  },
  "Rulings": {
    "Tengu": "\n●D. D. Scout Plane's effect can only activate once during the same End Phase, so if a combo of Banisher of the Light and King Tiger Wanghu is set up, D. D. Scout Plane will only be Special Summoned once.\n●It is the OWNER of D. D. Scout Plane that Special Summons it. Even if your opponent controls your D. D. Scout Plane, if it is removed from play, you get to Special Summon it.\n●If you don't have a vacant Monster Card Zone when D. D. Scout Plane would be Special Summoned, D. D. Scout Plane is destroyed and sent to the GY.\n●D. D. Scout Plane's effect activates whether it is removed from your hand, Deck, GY, or the field.\n●If D. D. Scout Plane is removed from play and is face-down while out of play, such as with Lightforce Sword or Different Dimension Capsule, D. D. Scout Plane's effect does not activate. But if D. D. Scout Plane was face-down on the field, and was removed by Nobleman of Crossout, it is placed face-up while out of play and its effect does activate.\n●If D. D. Scout Plane is face-down on the field while Banisher of the Light is in play, and D. D. Scout Plane is destroyed by Raigeki Break, it is removed from play and its effect activates because it is placed face-up out of play.\n●If D. D. Scout Plane is destroyed by Dark Ruler Ha Des and then removed from play to Special Summon Chaos Emperor Dragon - Envoy of the End, D. D. Scout Plane's effect activates and it will be Special Summoned.\n●If D. D. Scout Plane is destroyed by Lesser Fiend, D. D. Scout Plane's effect activates and it is Special Summoned even if Dark Ruler Ha Des was also in play when it was destroyed.\n●If D. D. Scout Plane is removed during an End Phase, it is Special Summoned with its effect during that same End Phase.\n●If D. D. Scout Plane is removed from play and then returned to the GY with Miracle Dig the same turn, its effect is reset and it remains in the GY and is not Special Summoned.\n●If Prohibition was used and D. D. Scout Plane is prohibited, D. D. Scout Plane cannot be Special Summoned and remains removed from play.\n●If D. D. Scout Plane is removed from play with Different Dimension Gate, D. D. Scout Plane's effect activates and D. D. Scout Plane is Special Summoned. If Different Dimension Gate is later destroyed, the other removed monster is returned to the field at that time.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. It is the OWNER of \"D. D. Scout Plane\" that Special Summons it. Even if your opponent controls your \"D. D. Scout Plane\", if it is removed from play, you get to Special Summon it.\\n2. If you don't have a vacant Monster Card Zone when \"D. D. Scout Plane\" would be Special Summoned, \"D. D. Scout Plane\" is destroyed and sent to the GY.\\n3. The effect of \"D. D. Scout Plane\" activates whether it is removed from your hand, Deck, GY, or the field.\\n4. If \"D. D. Scout Plane\" is removed from play and is face-down while out of play, such as with \"Lightforce Sword\" or \"Different Dimension Capsule\", the effect of \"D. D. Scout Plane\" does not activate. But if \"D. D. Scout Plane\" was face-down on the field, and was removed by \"Nobleman of Crossout\", it is placed face-up while out of play and its effect does activate.\\n5. If \"D. D. Scout Plane\" is face-down on the field while \"Banisher of the Light\" is in play, and \"D. D. Scout Plane\" is destroyed by \"Raigeki Break\", it is removed from play and its effect activates because it is placed face-up out of play.\\n6. If \"D. D. Scout Plane\" is destroyed by \"Dark Ruler Ha Des\" and then removed from play to Special Summon \"Chaos Emperor Dragon - Envoy of the End\", the effect of \"D. D. Scout Plane\" activates and it will be Special Summoned.\\n7. If \"D. D. Scout Plane\" is destroyed by \"Lesser Fiend\", the effect of \"D. D. Scout Plane\" activates and it is Special Summoned even if \"Dark Ruler Ha Des\" was also in play when it was destroyed.\\n8. If \"D. D. Scout Plane\" is removed during an End Phase, it is Special Summoned with its effect during that same End Phase.\\n9. The effect of \"D. D. Scout Plane\" can only activate once during the same End Phase, so if a combo of \"Banisher of the Light\" and \"King Tiger Wanghu\" is set up, \"D. D. Scout Plane\" will only be Special Summoned once.\\n10. If \"D. D. Scout Plane\" is removed from play and then returned to the GY with \"Miracle Dig\" the same turn, its effect is reset and it remains in the GY and is not Special Summoned.\\n11. If \"Prohibition\" was used and \"D. D. Scout Plane\" is prohibited, \"D. D. Scout Plane\" cannot be Special Summoned and remains removed from play.\\n12. If \"D. D. Scout Plane\" is removed from play with \"Different Dimension Gate\", the effect of \"D. D. Scout Plane\" activates and \"D. D. Scout Plane\" is Special Summoned. If \"Different Dimension Gate\" is later destroyed, the other removed monster is returned to the field at that time."
  },
  "PSCT": {
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}