{
  "id": 44508094,
  "name": "Stardust Dragon",
  "Stats": {
    "type": "Synchro Monster",
    "frameType": "synchro",
    "atk": 2500,
    "def": 2000,
    "level": 8,
    "race": "Dragon",
    "attribute": "WIND"
  },
  "Rulings": {
    "Tengu": "● The ① effect can only negate Cards/Effects which would 100% destroy a card(s) on the field (it cannot negate cards/effects like “Deck Devastation Virus” (if there are no face-up monsters), or “Snipe Hunter).\n● If the activation or effect of the ② effect is negated, it cannot activate again.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● Tributing 'Stardust Dragon' is a cost to activate its effect.\n● 'Stardust Dragon's' first effect can be activated during the Damage Step.\n● 'Stardust Dragon's' effects do not target.\n● 'Stardust Dragon's' first effect can still be chained if it is the only card that will be destroyed by the activated effect.\n● 'Stardust Dragon's' effect can be chained to the effect of a Continuous Spell/Trap Card, like 'Blaze Cannon' or 'Skull Lair'.\n● 'Stardust Dragon's' first effect can't be chained to an effect that may or may not destroy card(s) on the field, like 'Barrel Dragon' or 'Snipe Hunter'.\n● If 'Crush Card Virus' is activated and there is a face-up monster on the field that will be destroyed, 'Stardust Dragon's' effect can be chained.\n● If 'Royal Oppression's' effect is activated to negate the Special Summon of a monster, like 'Cyber Dragon' or 'Gladiator Beast Gyzarus', 'Stardust Dragon's' effect can't be chained because the monster being Special Summoned isn't considered to be 'on the field' until its Summon is successful.\n● 'Stardust Dragon's' second effect can only be chained to an effect that will destroy card(s) on the field. For example, if 'Night Assailant' second effect is activated when it is discarded, 'Stardust Dragon's' effect can't be chained because this effect does not destroy card(s) on the field.\n● If 'Stardust Dragon' is removed from play when its first effect is activated (by “Banisher of the Light,” etc.), or it is removed from the GY after its first effect is activated, it can't be Special Summoned with its effect during the End Phase.\n● If you Special Summon 'Stardust Dragon' during the End Phase and your opponent activates 'Torrential Tribute,' you can chain 'Stardust Dragon's' first effect to negate 'Torrential Tribute'. If you do, you can Special Summon 'Stardust Dragon' again during the same End Phase.\n● If your opponent controls your 'Stardust Dragon' and they use its effect, during the End Phase you will Special Summon it from your GY.\n● If 'Stardust Dragon' is attacking or being attacked and its effect is used in the Damage Step before damage calculation, damage calculation does not occur.\n● If your Defense Position 'Stardust Dragon' is attacked by 'Red Dragon Archfiend' and it is destroyed by battle, you can't chain 'Stardust Dragon's' effect to 'Red Dragon Archfiend's' effect that destroys your Defense Position monsters.",
    "TeleDAD": "● Tributing 'Stardust Dragon' is a cost to activate its effect.\n● 'Stardust Dragon's' first effect can be activated during the Damage Step.\n● 'Stardust Dragon's' effects do not target.\n● 'Stardust Dragon's' first effect can still be chained if it is the only card that will be destroyed by the activated effect.\n● 'Stardust Dragon's' effect can be chained to the effect of a Continuous Spell/Trap Card, like 'Blaze Cannon' or 'Skull Lair'.\n● 'Stardust Dragon's' first effect can't be chained to an effect that may or may not destroy card(s) on the field, like 'Barrel Dragon' or 'Snipe Hunter'.\n● If 'Crush Card Virus' is activated and there is a face-up monster on the field that will be destroyed, 'Stardust Dragon's' effect can be chained.\n● If 'Royal Oppression's' effect is activated to negate the Special Summon of a monster, like 'Cyber Dragon' or 'Gladiator Beast Gyzarus', 'Stardust Dragon's' effect can't be chained because the monster being Special Summoned isn't considered to be 'on the field' until its Summon is successful.\n● 'Stardust Dragon's' second effect can only be chained to an effect that will destroy card(s) on the field. For example, if 'Night Assailant' second effect is activated when it is discarded, 'Stardust Dragon's' effect can't be chained because this effect does not destroy card(s) on the field.\n● If 'Stardust Dragon' is removed from play when its first effect is activated (by “Banisher of the Light,” etc.), or it is removed from the GY after its first effect is activated, it can't be Special Summoned with its effect during the End Phase.\n● If you Special Summon 'Stardust Dragon' during the End Phase and your opponent activates 'Torrential Tribute,' you can chain 'Stardust Dragon's' first effect to negate 'Torrential Tribute'. If you do, you can Special Summon 'Stardust Dragon' again during the same End Phase.\n● If your opponent controls your 'Stardust Dragon' and they use its effect, during the End Phase you will Special Summon it from your GY.\n● If 'Stardust Dragon' is attacking or being attacked and its effect is used in the Damage Step before damage calculation, damage calculation does not occur.\n● If your Defense Position 'Stardust Dragon' is attacked by 'Red Dragon Archfiend' and it is destroyed by battle, you can't chain 'Stardust Dragon's' effect to 'Red Dragon Archfiend's' effect that destroys your Defense Position monsters.",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. Tributing \"Stardust Dragon\" is a cost to activate its effect.\\n2. The first effect of \"Stardust Dragon\" can be activated during the Damage Step.\\n3. The effects of \"Stardust Dragon\" do not target.\\n4. The first effect of \"Stardust Dragon\" can still be chained if it is the only card that will be destroyed by the activated effect.\\n5. The effect of \"Stardust Dragon\" can be chained to the effect of a Continuous Spell or Trap Card, like \"Blaze Cannon\" or \"Skull Lair\".\\n6. The first effect of \"Stardust Dragon\" cannot be chained to an effect that may or may not destroy card(s) on the field, like \"Barrel Dragon\" or \"Snipe Hunter\".\\n7. If \"Crush Card Virus\" is activated and there is a face-up monster on the field that will be destroyed, the effect of \"Stardust Dragon\" can be chained.\\n8. If the effect of \"Royal Oppression\" is activated to negate the Special Summon of a monster, like \"Cyber Dragon\" or \"Gladiator Beast Gyzarus\", the effect of \"Stardust Dragon\" cannot be chained because the monster being Special Summoned is not considered to be \"on the field\" until its Summon is successful.\\n9. The second effect of \"Stardust Dragon\" can only be chained to an effect that will destroy card(s) on the field. For example, if \"Night Assailant\" second effect is activated when it is discarded, the effect of \"Stardust Dragon\" cannot be chained because this effect does not destroy card(s) on the field.\\n10. If \"Stardust Dragon\" is removed from play when its first effect is activated (by \"Banisher of the Light\", etc.), or it is removed from the GY after its first effect is activated, it cannot be Special Summoned with its effect during the End Phase.\\n11. If you Special Summon \"Stardust Dragon\" during the End Phase and your opponent activates \"Torrential Tribute\", you can chain the first effect of \"Stardust Dragon\" to negate \"Torrential Tribute\". If you do, you can Special Summon \"Stardust Dragon\" again during the same End Phase.\\n12. If your opponent controls your \"Stardust Dragon\" and they use its effect, during the End Phase you will Special Summon it from your GY.\\n13. If \"Stardust Dragon\" is attacking or being attacked and its effect is used in the Damage Step before damage calculation, damage calculation does not occur.\\n14. If your Defense Position \"Stardust Dragon\" is attacked by \"Red Dragon Archfiend\" and it is destroyed by battle, you cannot chain the effect of \"Stardust Dragon\" to the effect of \"Red Dragon Archfiend\" that destroys your Defense Position monsters.\\n15. [FORUM] The effect of \"Stardust Dragon\" can be activated in response to the activation of \"Gemini Spark\".\\n16. [FORUM] The effect of \"Stardust Dragon\" to negate the destruction effect must be chained directly to the effect that it is trying to negate. This means that if two trigger effects are triggered simultaneously and are both placed on the Chain, \"Stardust Dragon\" will only be able to activate and negate in response to the effect in Chain link 2.\\n17. [FORUM] If \"Divine Wrath\" negates the effect of \"Stardust Dragon\" to negate and destroy a destruction effect, \"Stardust Dragon\" will not be able to activate its effect to Special Summon itself during the End Phase.\\n18. [FORUM] \"Stardust Dragon\" is not required to be Chain Link 2 in order to activate/resolve. \"Stardust Dragon\" can be Chain Link 10 as long as Chain Link 9 is a Spell Speed 2 effect that is destroying a card on the field.\\n19. [FORUM] If \"Stardust Dragon\" leaves the GY before it's effect activates in the End Phase, it will not Special Summon itself during the End Phase (its effect will not activate if returned to the GY, unless via its effect negation effect again).\\n20. [FORUM] \"Stardust Dragon\" can negate \"Sakuretsu Armor\"."
  },
  "PSCT": {
    "Tengu": "① 1 Tuner + 1 or more non-Tuners\nWhen a Spell/Trap Card/Effect, or Monster Effect, is activated, that would destroy a card(s) on the field when it resolves (Quick Effect): \nYou can Tribute this card; \nnegate the activation, and if you do, destroy it. \n② During the End Phase, if this effect was activated this turn (and wasn't negated): \nYou can Special Summon this card from your GY.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}