{
  "id": 47297616,
  "name": "Light and Darkness Dragon",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 2800,
    "def": 2400,
    "level": 8,
    "race": "Dragon",
    "attribute": "LIGHT"
  },
  "Rulings": {
    "Tengu": "● For the mandatory ③ effect to resolve, this card must be able to both negate the activation and also lose exactly 500 ATK and 500 DEF. If you can’t do either, you do neither.\n● Vs Spirit Monsters, Lyla, Treeborn Frog, Vayu, etc: \nThese trigger effects will be negated by this card’s ③ effect, and can then trigger again. \n(This can “loop” until Light and Darkness Dragon can’t lose any more ATK/DEF.)\n● Summoning a monster with the ④ happens after cards are destroyed.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "● For the mandatory ③ effect to resolve, this card must be able to both negate the activation and also lose exactly 500 ATK and 500 DEF. If you can’t do either, you do neither.\n● Vs Spirit Monsters, Lyla, Treeborn Frog, Vayu, etc: \nThese trigger effects will be negated by this card’s ③ effect, and can then trigger again. \n(This can “loop” until Light and Darkness Dragon can’t lose any more ATK/DEF.)\n● Summoning a monster with the ④ happens at the same time that cards are destroyed.",
    "Vegas": "● For the mandatory ③ effect to resolve, this card must be able to both negate the activation and also lose exactly 500 ATK and 500 DEF. If you can’t do either, you do neither.\n● Vs Spirit Monsters, Lyla, Treeborn Frog, Vayu, etc: \nThese trigger effects will be negated by this card’s ③ effect, and can then trigger again. \n(This can “loop” until Light and Darkness Dragon can’t lose any more ATK/DEF.)\n● Summoning a monster with the ④ happens at the same time that cards are destroyed.",
    "Meadowlands": "● For the mandatory ③ effect to resolve, this card must be able to both negate the activation and also lose exactly 500 ATK and 500 DEF. If you can’t do either, you do neither.\n● Vs Spirit Monsters, Lyla, Treeborn Frog, Vayu, etc: \nThese trigger effects will be negated by this card’s ③ effect, and can then trigger again. \n(This can “loop” until Light and Darkness Dragon can’t lose any more ATK/DEF.)\n● Summoning a monster with the ④ happens after cards are destroyed.",
    "FireWater": "● For the mandatory ③ effect to resolve, this card must be able to both negate the activation and also lose exactly 500 ATK and 500 DEF. If you can’t do either, you do neither.\n● Vs Spirit Monsters, Lyla, Treeborn Frog, Vayu, etc: \nThese trigger effects will be negated by this card’s ③ effect, and can then trigger again. \n(This can “loop” until Light and Darkness Dragon can’t lose any more ATK/DEF.)\n● Summoning a monster with the ④ happens at the same time that cards are destroyed.",
    "Cat": "[Rulings too long to display on discord]\n[Rulings are probably the same as edison]",
    "TeleDAD": "[Rulings too long to display on discord]\n[Rulings are probably the same as edison]",
    "Gladiator": "[Rulings too long to display on discord]\n[Rulings are probably the same as edison]",
    "ReturnDAD": "[Rulings too long to display on discord]\n[Rulings are probably the same as edison]",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "[Rulings too long to display on discord]\n[Rulings are probably the same as edison]",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. The first effect of \"Light and Darkness Dragon\" is a Continuous Effect that makes its Attributes both LIGHT and DARK while it is face-up on the field.\\n2. The second effect of \"Light and Darkness Dragon\" that negates the activation of Spell, Trap, and the effects of Effect Monsters is Quick Effect. \"Light and Darkness Dragon\" loses 500 ATK and DEF when its effect is resolved, after negating the activation of the Spell, Trap, or effect of the Effect Monster. This effect can be activated during the Damage Step.\\n3. The second effect of \"Light and Darkness Dragon\" can only activate once during the Chain. If a Spell, Trap, or effect of an Effect Monster is chained to the second effect of \"Light and Darkness Dragon\", the second effect of \"Light and Darkness Dragon\" will not activate again in that same Chain.\\n4. If the ATK and DEF of \"Light and Darkness Dragon\" are less than 500 when a Spell, Trap, or effect of an Effect Monster is activated, the second effect of \"Light and Darkness Dragon\" will still activate but when it resolves it will not negate the activation of the Spell, Trap, or effect of the Effect Monster because its ATK and DEF cannot be reduced by 500.\\n5. The ATK and DEF lost by \"Light and Darkness Dragon\" from its second effect is applied to its total ATK, including all other gains and losses of ATK and/or DEF. Example: If you use the second effect of \"Light and Darkness Dragon\" 4 times (500 X 4 = 2000 loss of ATK and DEF) while \"Luminous Spark\" is face-up on the Field Spell Card Zone, the \"Light and Darkness Dragon\" will have 1300 ATK and 0 DEF. If \"Luminous Spark\" is then removed from the field or negated, the \"Light and Darkness Dragon\" would change to 800 ATK and 400 DEF.\\n6. If \"Shrink\" is used to halve the original ATK of \"Light and Darkness Dragon\", the original ATK of \"Light and Darkness Dragon\" is halved to create a new current ATK and then the ATK and DEF lost by the effect of \"Light and Darkness Dragon\" is reapplied.\\n\\nExample: If you use the second effect of \"Light and Darkness Dragon\" twice (500 X 2 = 1000 lost ATK and DEF) and \"Shrink\" is used to halve the original ATK of \"Light and Darkness Dragon\", the effect of \"Shrink\" is applied (2800 / 2 = 1400 ATK) and then the ATK of \"Light and Darkness Dragon\" is reduced by 1000 (1400 - 1000 = 400) for a total of 400 ATK and 1400 DEF. When the effect of \"Shrink\" is no longer applied (because the turn had ended, etc.), reapply the lost ATK and DEF to the original ATK of 2800 of \"Light and Darkness Dragon\". (In our example, the values would be 1800 ATK and 1400 DEF)\\n7. The third effect of \"Light and Darkness Dragon\" is a Trigger Effect that activates whenever \"Light and Darkness Dragon\" is destroyed and sent to the GY. This effect targets 1 monster in its owner's GY. When the effect of \"Light and Darkness Dragon\" is resolved, you will destroy every card you control and then Special Summon the selected monster from your GY.\\n8. If your \"Light and Darkness Dragon\" is the only card on your side of the field when it is destroyed and sent to your GY, its effect to Special Summon 1 monster from your GY will still activate, even though you control no cards.\\n9. If the monster you select to Special Summon is removed from the GY in Chain (by using \"D.D. Crow\", etc.), before resolving the effect of \"Light and Darkness Dragon\", the selected monster will not be Special Summoned but you will still destroy every card that you control.\\n10. When \"Light and Darkness Dragon\" is destroyed and sent to your GY while you have no monsters in your GY that you can Special Summon, the effect of \"Light and Darkness Dragon\" will not Special Summon a monster but it will still destroy every card you control.\\n11. The third effect of \"Light and Darkness Dragon\" will activate when it is destroyed while in the hand or the Deck and sent to the GY.\\n\\nExample: \"Light and Darkness Dragon\" is destroyed by \"Crush Card Virus\" while in the player's hand.\\n12. If \"Light and Darkness Dragon\" is removed from the field or flipped face-down, any loses of ATK and DEF from its effect are reset and will not be reapplied when it is returned to the field or flipped face-up.\\n13. If \"Light and Darkness Dragon\" is Summoned or flipped face-up while \"Skill Drain\" is active, the first effect of \"Light and Darkness Dragon\" will be negated. Its second effect will still activate whenever a Spell, Trap, or effect of an Effect Monster is activated, but the effect of \"Light and Darkness Dragon\" will be negated so the activation of the Spell, Trap, or effect of Effect Monster will not be negated and \"Light and Darkness Dragon\" will not lose ATK or DEF. Its third effect that activates when it is destroyed and sent to the GY will not be negated because this effect activates and resolves while \"Light and Darkness Dragon\" is not on the field.\\n14. If you cannot Special Summon a monster because of a card's effect (\"Scapegoat\", etc.) when \"Light and Darkness Dragon\" is destroyed and sent to the GY you will not be able to Special Summon the selected monster but you must still destroy every card that you control.\\n15. If you cannot Special Summon a monster because all of your Monster Card Zones are forbidden (by \"Ground Collapse\", \"Ojama Knight\", etc.) when your \"Light and Darkness Dragon\" is destroyed and sent to the GY, the effect of \"Light of Darkness Dragon\" will not Special Summon a monster but it will still destroy every card that you control.\\n16. \"Light and Darkness Dragon\" cannot negate the activation of the Ignition-like effect of Continuous Spell or Trap Cards (\"Ultimate Offering\", etc.) or Field Spell Cards (\"Ancient City - Rainbow Ruins\", etc.). the second effect of \"Light and Darkness Dragon\" activates when a Spell or Trap Card is first activated (placed face-up onto the field or flipped face-up).\\n17. When the effect of a Normal Spell Card is activated in the GY due to the effect of \"Destiny HERO - Diamond Dude\", the second effect of \"Light and Darkness Dragon\" will not activate because the Normal Spell Card is not 'activated'.\\n18. When \"Light and Darkness Dragon\" negates the activation of a Continuous Spell or Trap Card, the Continuous Spell or Trap Card is sent to the GY. When \"Light and Darkness Dragon\" negates the activation of \"Swords of Revealing Light\", the \"Swords of Revealing Light\" is sent to the GY.\\n19. When the effect of a Spell, Trap, or effect of an Effect Monster is activated while the card is in your hand (\"Green Baboon, Defender of the Forest\", etc.), the card will remain in the player's hand when its activation is negated by \"Light and Darkness Dragon\".\\n20. If a monster with an optional Trigger Effect, like \"Peten the Dark Clown\" or \"Infernal Dragon\", is destroyed by the third effect of \"Light and Darkness Dragon\", the timing to activate the effect of the destroyed monster is missed because immediately afterwards a monster is Special Summoned. The last thing to happen when resolving the effect is the Special Summon of a monster and not the destruction of \"Peten the Dark Clown\" or \"Infernal Dragon\".\\n21. When \"Light and Darkness Dragon\" negates the activation of a Spell, Trap, or effect of an Effect Monster that can only be activated once per turn (\"Blowback Dragon\", etc.), the Spell, Trap, or effect of the Effect Monster cannot be activated again because the Spell, Trap, or effect of the Effect Monster is treated as having been activated during that turn. If the effect of the Effect Monster can be activated multiple times during the same turn (\"Treeborn Frog\", etc.), the effect of the Effect Monster can be activated again.\\n22. If you have 2 or more \"Light and Darkness Dragon\" face-up on your side of the field when a Spell, Trap, or effect of an Effect Monster is activated, the effect of each \"Light and Darkness Dragon\" form a Chain, but only the effect of the \"Light and Darkness Dragon\" chained directly to the activated Spell, Trap, or effect of an Effect Monster will resolve. The other \"Light and Darkness Dragon\" on the Chain will not negate the activation of the Spell, Trap, or effect of the Effect Monster and they will not lose any ATK or DEF from their effect.\\n\\nExample: Player A and Player B each have \"Light and Darkness Dragon\" face-up on the field. Player A activates \"Smashing Ground\" in his Main Phase 1. The effect of both copies of \"Light and Darkness Dragon\" activate. Player A is the turn player, so theirs is placed first onto the Chain (\"Light and Darkness\" Dragon A), followed by their opponent's (\"Light and Darkness Dragon\" B). Since Player A's \"Light and Darkness Dragon\" is chained directly to \"Smashing Ground\", it will negate the \"Smashing Ground\" and lose 500 ATK and DEF. Player B's \"Light and Darkness Dragon\" will not negate \"Smashing Ground\" and will not lose ATK or DEF.\\n23. If you Tribute \"Sangan\" and \"Witch of the Black Forest\" to Tribute Summon \"Light and Darkness Dragon\", the effect of \"Sangan\" and \"Witch of the Black Forest\" form a Chain. \"Light and Darkness Dragon\" will negate the activation of whichever effect is placed second on the Chain.\\n24. If the second effect of \"Light and Darkness Dragon\" is activated and an effect is chained that removes \"Light and Darkness Dragon\" from the field or flips it face-down, the effect of \"Light and Darkness Dragon\" will disappear and the activation of the Spell, Trap, or effect of the Effect Monster will not be negated.\\n25. If \"Light and Darkness Dragon\" negates the activation of the effect of \"Twin-Headed Behemoth\", the effect of \"Twin-Headed Behemoth\" will not activate again during the Duel.\\n26. If the activation of the effect of \"Destiny HERO - Dasher\" that Special Summons a monster is negated by \"Light and Darkness Dragon\", the \"Destiny HERO - Dasher\" will not be able to activate the effect while it remains in the GY. If it is removed from the GY and then later returned to the GY, it will be able to activate its effect once again.\\n27. When \"Light and Darkness Dragon\" negates the activation of a Spirit Monster's effect that would return it to its owner's hand, the effect of the Spirit Monster activates again during the same End Phase. When the return effect of the Spirit Monster is activated during the End Phase while \"Light and Darkness Dragon\" has less than 500 ATK and DEF, the second effect of \"Light and Darkness Dragon\" will still activate, but it will not be able to negate the activation and the Spirit Monster will return to its owner's hand.\\n28. \"Light and Darkness Dragon\" will negate the activation of the effect of \"Serpentine Princess\" when the face-up \"Serpentine Princess\" is sent from the field to the Deck. (\"Serpentine Princess\" remains in the Deck)\\n29. \"Light and Darkness Dragon\" will negate the activation of the effect of \"Mokey Mokey King\" that activates when it is removed from the field, even if it is returned to the Fusion Deck.\\n30. If \"Light and Darkness Dragon\" is destroyed and sent to the GY while being treated as an Equip Card, its third effect that Special Summons 1 monster will activate.\\n31. When a monster is Summoned that has an effect that activates at the time the monster is successfully Summoned (\"Zaborg the Thunder Monarch\", \"Breaker the Magical Warrior\", etc.) while \"Light and Darkness Dragon\" is face-up on the field, the effect of the Summoned monster will be Chain Link 1 and \"Light and Darkness Dragon\" will be Chain Link 2. Because of this, it is not possible to use \"Pulling the Rug\" to negate the effect of the monster if it was Normal Summoned.\\n32. If \"Light and Darkness Dragon\" negates the activation of the effect of \"Majestic Mech - Ohka\" or \"Majestic Mech - Goryu\" that activate during the End Phase, the effect of the \"Majestic Mech - Ohka\" or \"Majestic Mech - Goryu\" will activate again during the same End Phase. If the effect of \"Majestic Mech - Ohka\" or \"Majestic Mech - Goryu\" is activated during the End Phase while \"Light and Darkness Dragon\" has less than 500 ATK and DEF, the second effect of \"Light and Darkness Dragon\" will still activate, but it will not be able to negate the activation and the \"Majestic Mech - Ohka\" or \"Majestic Mech - Goryu\" will be sent to the GY.\\n33. During the turn \"Reverse Trap\" is activated, the second effect of \"Light and Darkness Dragon\" will only activate 1 time after \"Reverse Trap\" resolves. When it does, it will gain 500 ATK and DEF instead of losing 500 ATK and DEF. The second effect of \"Light and Darkness Dragon\" will activate normally during following turns, and if it gained 500 ATK and DEF the gained ATK and DEF becomes a loss of 500 ATK and DEF.\\n\\nExample: Player A activates \"Reverse Trap\" in his Main Phase 1. Afterwards, he Tribute Summons \"Light and Darkness Dragon\". Player B activates \"Bottomless Trap Hole\". The effect of \"Light and Darkness Dragon\" activates, negating \"Bottomless Trap Hole\" and gaining 500 ATK and DEF. During the Battle Phase, Player A attacks with \"Light and Darkness Dragon\". Player B activates \"Sakuretsu Armor\". The second effect of \"Light and Darkness Dragon\" does not activate and it is destroyed by \"Sakuretsu Armor\".\\n34. [FORUM] The effect of \"Spirit Reaper\" that keeps it from being destroyed as a result of battle is a Continuous Effect and does not use the Chain. The effect of \"Light and Darkness Dragon\" will not be able to negate it.\\n35. [FORUM] If the activation of a Continuous Spell Card, Continuous Trap Card, or Field Spell Card is negated, such as with \"Light and Darkness Dragon\", the card is sent to the GY. It does not remain on the Field meaninglessly.\\n36. [FORUM] If \"Light and Darkness Dragon\" negates a 'Madolche' monster's effect to shuffle into the Deck when destroyed, it will not activate the effect again. The difference between a 'Madolche' effect and a 'Lightsworn' effect is between things that happen during a period of time (Lightsworn), and things that happen when a specific triggering event occurs (Madolche)."
  },
  "PSCT": {
    "Tengu": "① Can't be Special Summoned. \n② While face-up on the field, this card is also DARK. \n③ Once per Chain, if a Spell/Trap Card, or Monster Effect is activated (Quick): \nThis card loses exactly 500 ATK/DEF and that activation is negated. \n④ If this card is destroyed and sent to the GY: Target 1 monster in your GY (if possible); \ndestroy all cards you control, then Special Summon that monster (if any).",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "① Can't be Special Summoned. \n② While face-up on the field, this card is also DARK. \n③ Once per Chain, if a Spell/Trap Card, or Monster Effect is activated (Quick): \nThis card loses exactly 500 ATK/DEF and that activation is negated. \n④ If this card is destroyed and sent to the GY: Target 1 monster in your GY (if possible); \ndestroy all cards you control, also Special Summon that monster (if any).",
    "Meadowlands": "① Can't be Special Summoned. \n② While face-up on the field, this card is also DARK. \n③ Once per Chain, if a Spell/Trap Card, or Monster Effect is activated (Quick): \nThis card loses exactly 500 ATK/DEF and that activation is negated. \n④ If this card is destroyed and sent to the GY: Target 1 monster in your GY (if possible); \ndestroy all cards you control, then Special Summon that monster (if any).",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}