{
  "id": 49980185,
  "name": "Supernatural Regeneration",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Normal"
  },
  "Rulings": {
    "Edison": "●You count Psychic monsters sent to any GY, including your opponent’s.\n●“Zombie World” will change all Psychic monsters into Zombies, including in the GY, so any Psychic monsters sent to the GY will be Zombies instead, and won't count for “Supernatural Regeneration” (in fact, you can't activate “Supernatural Regeneration” in that case).\n●Effects that change Type on the field, like “DNA Surgery”, won't apply in the GY, so Psychic monsters sent to the GY while “DNA Surgery” is active still count as “Psychic-Type monsters sent to the GY this turn” (so you gain Life Points for them).\n●Returning Psychic monsters to the GY (with “Miracle Dig”, etc.) does not count as “sending” them to the GY, so they don't count for “Supernatural Regeneration”.\n●Even if Psychic monsters sent to the GY are no longer in the GY during the End Phase, they still can count for “Supernatural Regeneration”.",
    "Tengu": "\n●You count Psychic monsters sent to any GY, including your opponent’s.\n●“Zombie World” will change all Psychic monsters into Zombies, including in the GY, so any Psychic monsters sent to the GY will be Zombies instead, and will not count for “Supernatural Regeneration” (in fact, you cannot activate “Supernatural Regeneration” in that case).\n●Effects that change Type on the field, like “DNA Surgery”, will not apply in the GY, so Psychic monsters sent to the GY while “DNA Surgery” is active still count as “Psychic-Type monsters sent to the GY this turn” (so you gain Life Points for them).\n●Returning Psychic monsters to the GY (with “Miracle Dig”, etc.) does not count as “sending” them to the GY, so they do not count for “Supernatural Regeneration”.\n●Even if Psychic monsters sent to the GY are no longer in the GY during the End Phase, they still can count for “Supernatural Regeneration”.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. You count Psychic monsters sent to any GY, including your opponent's.\\n2. \"Zombie World\" will change all Psychic monsters into Zombies, including in the GY, so any Psychic monsters sent to the GY will be Zombies instead, and will not count for \"Metaphysical Regeneration\" (in fact, you cannot activate \"Metaphysical Regeneration\" in that case).\\n3. Effects that change Type on the field, like \"DNA Surgery\", will not apply in the GY, so Psychic monsters sent to the GY while \"DNA Surgery\" is active still count as \"Psychic-Type monsters sent to the GY this turn\" (so you gain Life Points for them).\\n4. Returning Psychic monsters to the GY (with \"Miracle Dig\", etc.) does not count as 'sending' them to the GY, so they do not count for \"Metaphysical Regeneration\".\\n5. Even if Psychic monsters sent to the GY are no longer in the GY during the End Phase, they still can count for \"Metaphysical Regeneration\"."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "Activate only during the End Phase. Gain 1000 Life Points for each Psychic-Type monster sent to the Graveyard this turn."
  }
}