{
  "id": 52860176,
  "name": "Possessed Dark Soul",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 1200,
    "def": 800,
    "level": 3,
    "race": "Fiend",
    "attribute": "DARK"
  },
  "Rulings": {
    "Edison": "●If the opponent has more Level 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy Griggle or Ameba in this manner, their effects don't activate since they never came to your side of the field.\n●You can't gain control of face-down monsters with this card’s effect, so the opponent may chain Book of Moon selecting a Level 3 or lower monster and they will keep control of it.\n●You maintain control of the monsters until they are removed from the field.",
    "Tengu": "\n●If the opponent has more Level 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy Griggle or Ameba in this manner, their effects do not activate since they never came to your side of the field.\n●You cannot gain control of face-down monsters with this card’s effect, so the opponent may chain Book of Moon selecting a Level 3 or lower monster and they will keep control of it.\n●You maintain control of the monsters until they are removed from the field.",
    "Goat": "●If the opponent has more Lv 3 or lower monsters on the field than you have empty Monster Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy Griggle or Ameba in this manner, their effects do not activate since they never came to your side of the field.\n●You cannot gain control of face-down monsters with this card’s effect, so the opponent may chain Book of Moon selecting a Lv 3 or lower monster and they will keep control of it.\n●You maintain control of the monsters until they are removed from the field.EXAMPLE #1: I have Pole Position, Luminous Spark (+500 to LIGHT), and Gemini Elf (1900 ATK / EARTH) face-up on the field. “Gemini Elf” is the monster on the field with the highest ATK, so it is unaffected by Spell Cards. If the opponent Summons X-Head Cannon (1800 ATK / LIGHT), “Luminous Spark” will raise the ATK of “X-Head Cannon” to 2300, making it the highest ATK monster on the field, so it’s unaffected by Spell Cards, so it drops to 1800 ATK, then increases to 2300, then drops to 1800, etc. This would create an infinite loop. Therefore, the opponent cannot Summon “X-Head Cannon”. \n●EXAMPLE #2: The opponent has Blue-Eyes White Dragon (3000 ATK) and “Pole Position” face-up on the field. I have Gemini Elf (1900 ATK), and an Opticlops (1800 ATK) equipped with Axe of Despair(+1000 ATK; 2800 total) face-up on the field, and a Set Ring of Destruction. If I activate Ring of Destruction to destroy Blue-Eyes White Dragon, then “Opticlops” will be the highest ATK monster on the field, and cause an infinite loop (it is the highest, it isn’t, it is, it isn’t, etc.). Therefore, I cannot target “Blue-Eyes White Dragon” with “Ring of Destruction”. \n●EXAMPLE #3: The opponent has a face-down Pole Position. I have Opticlops (1800 ATK) and Gemini Elf (1900 ATK) face-up on the field. I activate Axe of Despair (+1000 ATK) and try to equip my Opticlops (1800 ATK). The opponent cannot chain Pole Position, since that would cause an infinite loop. “Pole Position” is an illegal activation. Put it back face-down. \n●EXAMPLE #4: I have Pole Position, Blade Knight (1600 ATK / LIGHT), and Luminous Spark (+500 ATK to LIGHT) face-up on the field and 2 cards in my hand. The opponent has Giant Orc (2200 ATK / EARTH) face-up on the field, which is the highest-ATK monster on the field. If I Set 1 of the 2 cards in my hand, “Blade Knight” gains +400 ATK with its effect, becomes the highest-ATK monster, and because of “Luminous Spark” an infinite loop is created. So I am not allowed to Set a card. EXAMPLE #5: I have Pole Position and Opticlops (1800 ATK) face-up on the field. The opponent has a Muka Muka equipped with Axe of Despair face-up on the field with no cards in his hand. At the start of the opponent's turn, he draws a card, making Muka Mukas ATK 1900. An infinite loop is created by something that could not be avoided, so “Pole Position” is destroyed.\n●EXAMPLE #6: The opponent has “Blade Knight” (1600 ATK) equipped with “Butterfly Dagger - Elma” (+300 ATK; 1900 ATK total) and 2 cards in hand, along with “Marauding Captain” (1200 ATK). The turn player has “Robbin’ Goblin”, “Pole Position”, and “Giant Orc” (2200 ATK). The turn player attacks “Marauding Captain” with “Giant Orc”, inflicting 1000 points of damage. The opponent has to discard a card because of “Robbin’ Goblin” and an infinite loop is created because “Blade Knight” now fluctuates between 2300 and 2000 ATK (either above or below “Giant Orc”, making it the strongest monster on the field… or not). Therefore, “Pole Position” is destroyed.\n●EXAMPLE #7: I have Pole Position, Banner of Courage, and Opticlops face-up on the field. The opponent has Gemini Elf face-up on the field. When I enter my Battle Phase, an infinite loop is created as “Opticlops” fluctuates between 1800 and 2000 ATK. So “Pole Position” is destroyed.\n●EXAMPLE #8: I have Pole Position, Gemini Elf (1900 ATK / EARTH) and Mystic Plasma Zone (+500 ATK to DARK) face-up on the field, and an Opticlops (1800 ATK / DARK) in face-down Defense Position. The opponent attacks my face-down Opticlops with Mokey Mokey. When we flip Opticlops face-up in the Damage Step, an infinite loop is created as “Opticlops” fluctuates between 1800 and 2300 ATK (either above or below “Gemini Elf”, making it the strongest monster on the field, or not). Therefore, “Pole Position” is destroyed.If there are more level 3 or lower monsters on the opponent’s field than there is space on the player’s field when “Possessed Dark Soul” is Tributed for its effect, the excess monsters are destroyed.\n●If a monster is reduced to Lv 3 or lower by the effect of “Demotion,” and control is taken by the effect of “Possessed Dark Soul,” control will not return to the other player if “Demotion” becomes inactive.",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "TeleDAD": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "Gladiator": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "ReturnDAD": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "Trooper": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "Circle": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "Stein": "● If the opponent has more LV 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy 'Griggle' or 'Ameba' in this manner, their effects do not activate since they never came to your side of the field.\n● You can't gain control of face-down monsters with this card’s effect, so the opponent may chain 'Book of Moon' selecting a LV 3 or lower monster and they will keep control of it.\n● You maintain control of the monsters until they are removed from the field.",
    "Base": "1. If the opponent has more Level 3 or lower monsters on the field than you have empty Monster Card Zones after you Tribute this card (the Zone it occupied is now empty), you choose which ones to gain control of and the rest are destroyed. If you choose to destroy \"Griggle\" or \"Ameba\" in this manner, their effects do not activate since they never came to your side of the field.\\n2. You cannot gain control of face-down monsters with this card's effect, so the opponent may chain \"Book of Moon\" selecting a Level 3 or lower monster and they will keep control of it.\\n3. You maintain control of the monsters until they are removed from the field."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "You can Tribute this face-up card; take control of all face-up Level 3 or lower monsters your opponent currently controls."
  }
}