{
  "id": 56252810,
  "name": "Assault Revival",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Quick-Play"
  },
  "Rulings": {
    "Edison": "Remove from play 1 Assault Mode Activate from your GY. Destroy all monsters you control and Special Summon 1 /Assault Mode monster from your GY, ignoring its Summoning conditions. Its effect●Banishing 1 Assault Mode Activate from your GY is a cost. This card can't be activated while Imperial Iron Wall is active, since you can't pay the cost.\n●“Assault Revival” can only Special Summon an “/Assault Mode” monster that was properly Special Summoned in the first place, and was then sent to the GY. It can't Special Summon an “/Assault Mode” monster that was directly sent to the GY from the hand/Deck.\n●Only effects on the field are negated by “Assault Revival”. If an “/Assault Mode” monster is Special Summoned with “Assault Revival”, and is then destroyed (and removed from play because of “Assault Revival”’s effect), its effect does activate and the appropriate Synchro Monster is Special Summoned.\n●You must destroy at least 1 monster you control with “Assault Revival” in order to Special Summon an “/Assault Mode” monster, as the effects are linked. You also must destroy all monsters you control, so if 1 of your monsters was not destroyed, you can't Summon an “/Assault Mode” monster.\n●A monster Special Summoned with “Assault Revival” can't activate its effects even if “Pole Position” makes it unaffected by Spell Cards. If an “/Assault Mode” monster is Special Summoned with “Assault Revival”, and is flipped face-down, the restrictions from “Assault Revival” are wiped and you can Tribute it and (once it is face-up again) activate its effects.\n●This card targets the “/Assault Mode” monster in the GY that you wish to Special Summon.",
    "Tengu": "Remove from play 1 Assault Mode Activate from your GY. Destroy all monsters you control and Special Summon 1 /Assault Mode monster from your GY, ignoring its Summoning conditions. Its effect(s) is negated, and it cannot be Tributed. If it is removed from the field, remove it from play.\n●Banishing 1 Assault Mode Activate from your GY is a cost. This card can't be activated while Imperial Iron Wall is active, since you can't pay the cost.\n●“Assault Revival” can only Special Summon an “/Assault Mode” monster that was properly Special Summoned in the first place, and was then sent to the GY. It cannot Special Summon an “/Assault Mode” monster that was directly sent to the GY from the hand or Deck.\n●Only effects on the field are negated by “Assault Revival”. If an “/Assault Mode” monster is Special Summoned with “Assault Revival”, and is then destroyed (and removed from play because of “Assault Revival”’s effect), its effect does activate and the appropriate Synchro Monster is Special Summoned.\n●You must destroy at least 1 monster you control with “Assault Revival” in order to Special Summon an “/Assault Mode” monster, as the effects are linked. You also must destroy all monsters you control, so if 1 of your monsters was not destroyed, you cannot Summon an “/Assault Mode” monster.\n●A monster Special Summoned with “Assault Revival” cannot activate its effects even if “Pole Position” makes it unaffected by Spell Cards. If an “/Assault Mode” monster is Special Summoned with “Assault Revival”, and is flipped face-down, the restrictions from “Assault Revival” are wiped and you can Tribute it and (once it is face-up again) activate its effects.\n●This card targets the “/Assault Mode” monster in the GY that you wish to Special Summon.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. \"Assault Revival\" can only Special Summon an '/Assault Mode' monster that was properly Special Summoned in the first place, and was then sent to the GY. It cannot Special Summon an '/Assault Mode' monster that was directly sent to the GY from the hand or Deck.\\n2. Only effects on the field are negated by \"Assault Revival\". If an '/Assault Mode' monster is Special Summoned with \"Assault Revival\", and is then destroyed (and removed from play because of the effect of \"Assault Revival\"), its effect does activate and the appropriate Synchro Monster is Special Summoned.\\n3. You must destroy at least 1 monster you control with \"Assault Revival\" in order to Special Summon an '/Assault Mode' monster, as the effects are linked. You also must destroy all monsters you control, so if 1 of your monsters was not destroyed, you cannot Summon an '/Assault Mode' monster.\\n4. A monster Special Summoned with \"Assault Revival\" cannot activate its effects even if \"Pole Position\" makes it unaffected by Spell Cards.\\n5. If an '/Assault Mode' monster is Special Summoned with \"Assault Revival\", and is flipped face-down, the restrictions from \"Assault Revival\" are wiped and you can Tribute it and (once it is face-up again) activate its effects.\\n6. This card targets the '/Assault Mode' monster in the GY that you wish to Special Summon."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}