{
  "id": 5861892,
  "name": "Arcana Force EX - The Light Ruler",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 4000,
    "def": 4000,
    "level": 10,
    "race": "Fairy",
    "attribute": "LIGHT"
  },
  "Rulings": {
    "Tengu": "(C) This card cannot be Normal Summoned or Set. (U) This card cannot be Special Summoned except by sending 3 monsters you control to the GY. (1) When this card is Special Summoned, toss a coin: ● Heads: When this card destroys an opponent's monster by battle and sends it to the GY, you can add 1 card from your GY to your hand. ● Tails: When an effect of a Spell, Trap or Effect Monster's effect that targets this card is activated, negate its activation and destroy it, and this card loses 1000 ATK.\n●The (C) Condition cannot be negated.\n●The (U) Unclassified Effect applies in the hand (this Special Summon does not start a Chain).\n●Sending 3 monsters you control to the GY is a cost. You cannot send Monster Tokens or a face-up Battle Fader (Special Summoned by its effect) to the GY.\n●You can't Special Summon this card from the GY / banished, even if properly Summoned.\n●You can't Special Summon this card from the hand / Deck by another effect.\n●The (1) Trigger Effect is mandatory, it activates & resolves on the field.\n●When this effect resolves, this card gains the corresponding Effect. The corresponding effect can be negated by Skill Drain, but this card will not forget which effect is gained while face-up.\n●If the heads / tails effect of Arcana Force EX - The Light Ruler is activated and an effect is chained that removes it from the field, the effect of Arcana Force EX - The Light Ruler still resolves.\n●When Arcana Force EX - The Light Ruler is Special Summoned and its effect activates, if an effect is chained that flips it face-down or removes it from the field, the effect of Arcana Force EX - The Light Ruler disappears and you do not toss a coin.\n●If Skill Drain is activated after Arcana Force EX - The Light Ruler is Special Summoned, the effect of Arcana Force EX - The Light Ruler is negated. If Skill Drain is later negated or removed from the field, the effect of Arcana Force EX - The Light Ruler is not reapplied.\n●The (HEADS) Trigger Effect is optional, it activates & resolves on the field.\n●This effect can activate if this card is face-up on the field in Substep 7 - End of the Damage Step\n●This effect targets 1 card in the GY, it will be negated by Necrovalley.\n●The (TAILS) Quick Effect is mandatory, it activates & resolves on the field.\n●This effect can activate multiple times in the same Chain.\n●While the tails effect of Arcana Force EX - The Light Ruler is being applied, it is mandatory. If you activate a Spell, Trap, or Effect Monster's effect that targets your Arcana Force EX - The Light Ruler while its tails effect is being applied, it will negate the effect of your Spell, Trap, or Effect Monster Card and destroy it.\n●If Reverse Trap  is being applied while the tails effect of Arcana Force EX - The Light Ruler is being applied, Arcana Force EX - The Light Ruler will gain 1000 ATK instead of losing 1000 ATK when its effect resolves. After the turn ends, all gained ATK becomes an ATK loss.\n●If an effect targets Arcana Force EX - The Light Ruler while its ATK is less than 1000 and its tails effect is being applied, Arcana Force EX - The Light Ruler's tails effect still activates. If Arcana Force EX - The Light Ruler's ATK is less than 1000 when its tails effect resolves, its effect disappears.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● While the tails effect of 'Arcana Force EX - The Light Ruler' is being applied, it is mandatory. If you activate a Spell, Trap, or Effect Monster's effect that targets your 'Arcana Force EX - The Light Ruler' while its tails effect is being applied, it will negate the effect of your Spell, Trap, or Effect Monster Card and destroy it.\n● If the heads or tails effect of 'Arcana Force EX - The Light Ruler' is activated and an effect is chained that removes it from the field, the effect of 'Arcana Force EX - The Light Ruler' still resolves.\n● The tails effect of 'Arcana Force EX - The Light Ruler' can chain multiple times in the same Chain.Example: When 'Arcana Force EX - The Light Ruler' is targeted by 'Shrink', its effect activates. If 'Ring of Destruction' is chained to its effect, its effect activates again.\n● If an effect targets 'Arcana Force EX - The Light Ruler' while its ATK is less than 1000 and its tails effect is being applied, 'Arcana Force EX - The Light Ruler's' tails effect still activates. If 'Arcana Force EX - The Light Ruler's' ATK is less than 1000 when its tails effect resolves, its effect disappears.\n● If 'Reverse Trap ' is being applied while the tails effect of 'Arcana Force EX - The Light Ruler' is being applied, 'Arcana Force EX - The Light Ruler' will gain 1000 ATK instead of losing 1000 ATK when its effect resolves. After the turn ends, all gained ATK becomes an ATK loss.\n● If 'Skill Drain' is activated after 'Arcana Force EX - The Light Ruler' is Special Summoned, the effect of 'Arcana Force EX - The Light Ruler' is negated. If 'Skill Drain' is later negated or removed from the field, the effect of 'Arcana Force EX - The Light Ruler' isn't reapplied.\n● When 'Arcana Force EX - The Light Ruler' is Special Summoned and its effect activates, if an effect is chained that flips it face-down or removes it from the field, the effect of 'Arcana Force EX - The Light Ruler' disappears and you do not toss a coin.",
    "TeleDAD": "● While the tails effect of 'Arcana Force EX - The Light Ruler' is being applied, it is mandatory. If you activate a Spell, Trap, or Effect Monster's effect that targets your 'Arcana Force EX - The Light Ruler' while its tails effect is being applied, it will negate the effect of your Spell, Trap, or Effect Monster Card and destroy it.\n● If the heads or tails effect of 'Arcana Force EX - The Light Ruler' is activated and an effect is chained that removes it from the field, the effect of 'Arcana Force EX - The Light Ruler' still resolves.\n● The tails effect of 'Arcana Force EX - The Light Ruler' can chain multiple times in the same Chain.Example: When 'Arcana Force EX - The Light Ruler' is targeted by 'Shrink', its effect activates. If 'Ring of Destruction' is chained to its effect, its effect activates again.\n● If an effect targets 'Arcana Force EX - The Light Ruler' while its ATK is less than 1000 and its tails effect is being applied, 'Arcana Force EX - The Light Ruler's' tails effect still activates. If 'Arcana Force EX - The Light Ruler's' ATK is less than 1000 when its tails effect resolves, its effect disappears.\n● If 'Reverse Trap ' is being applied while the tails effect of 'Arcana Force EX - The Light Ruler' is being applied, 'Arcana Force EX - The Light Ruler' will gain 1000 ATK instead of losing 1000 ATK when its effect resolves. After the turn ends, all gained ATK becomes an ATK loss.\n● If 'Skill Drain' is activated after 'Arcana Force EX - The Light Ruler' is Special Summoned, the effect of 'Arcana Force EX - The Light Ruler' is negated. If 'Skill Drain' is later negated or removed from the field, the effect of 'Arcana Force EX - The Light Ruler' isn't reapplied.\n● When 'Arcana Force EX - The Light Ruler' is Special Summoned and its effect activates, if an effect is chained that flips it face-down or removes it from the field, the effect of 'Arcana Force EX - The Light Ruler' disappears and you do not toss a coin.",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg"
  },
  "PSCT": {
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}