{
  "id": 71645242,
  "name": "Black Garden",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Field"
  },
  "Rulings": {
    "Edison": "Regarding Summoning Tokens with the ①: \n● A token is Summoned even if the monster's ATK can't be halved, as long as the monster is still on the field when the ① resolves (even if it's face-down/was summoned face-down).\n● Even if 2+ monsters are summoned at the same time, only 1 Token is Summoned.\n● The player who Summons the token is always the player who controls Black Garden.\n● The \"owner\" of the token is opponent of the player whose field it is Summoned to.\nIf you control Garden and activate Scapegoat, no Rose Token is Summoned.\nIf you control Garden, and the opponent activates Scapegoat, you Summon a Rose Token.\n\nHalving ATK with the ①: \n● The ATK loss remains even if Garden leaves the field or later becomes negated.\n● If \"Shrink\" is later used on the monster whose ATK was halved: \nIts ATK becomes half its original ATK, and in the End Phase, its ATK becomes its original (printed) ATK.",
    "Tengu": "● A token is summoned even if the monster's ATK can't be halved, \nas long as that monster is still on the field when this effect resolves\n(even if it's face-down or was summoned face-down).\n\n● The ATK loss remains even if this card's effect becomes negated or if it leaves the field.\n● If \"Shrink\" is later used on the monster whose ATK was halved: \nIts ATK becomes half its original ATK, and in the End Phase, its ATK becomes its original (printed) ATK.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "● The owner of \"Black Garden\" always Summons the Token.\n\n● A token is summoned even if the monster's ATK can't be halved,\nas long as that monster is still on the field when this effect resolves\n(even if it's face-down or was summoned face-down).\n\n● The ATK loss remains even if this card's effect becomes negated or if it leaves the field.\n● If \"Shrink\" is chained to the effect to halve ATK:\nIts original ATK is halved by \"Shrink\", then its halved ATK is halved again, and permanently remains halved.\n● If \"Shrink\" is later used on the monster whose ATK was halved:\nIts ATK becomes half its original ATK, and in the End Phase, its ATK becomes its original (printed) ATK.\n● If \"Forbidden Lance\" is later used on the monster whose ATK was halved:\nIts current ATK is reduced by 800 (until the End Phase), but Garden's halving effect still applies.",
    "Vegas": "● The owner of \"Black Garden\" always Summons the Token.\n\n● A token is summoned even if the monster's ATK can't be halved,\nas long as that monster is still on the field when this effect resolves\n(even if it's face-down or was summoned face-down).\n\n● The ATK loss remains even if this card's effect becomes negated or if it leaves the field.\n● If \"Shrink\" is chained to the effect to halve ATK:\nIts original ATK is halved by \"Shrink\", then its halved ATK is halved again, and permanently remains halved.\n● If \"Shrink\" is later used on the monster whose ATK was halved:\nIts ATK becomes half its original ATK, and in the End Phase, its ATK becomes its original (printed) ATK.\n● If \"Forbidden Lance\" is later used on the monster whose ATK was halved:\nIts current ATK is reduced by 800 (until the End Phase), but Garden's halving effect still applies.",
    "Meadowlands": "● The owner of \"Black Garden\" always Summons the Token.\n\n● A token is summoned even if the monster's ATK can't be halved,\nas long as that monster is still on the field when this effect resolves\n(even if it's face-down or was summoned face-down).\n\n● The ATK loss remains even if this card's effect becomes negated or if it leaves the field.\n● If \"Shrink\" is chained to the effect to halve ATK:\nIts original ATK is halved by \"Shrink\", then its halved ATK is halved again, and permanently remains halved.\n● If \"Shrink\" is later used on the monster whose ATK was halved:\nIts ATK becomes half its original ATK, and in the End Phase, its ATK becomes its original (printed) ATK.\n● If \"Forbidden Lance\" is later used on the monster whose ATK was halved:\nIts current ATK is reduced by 800 (until the End Phase), but Garden's halving effect still applies.",
    "FireWater": "● The owner of \"Black Garden\" always Summons the Token.\n\n● A token is summoned even if the monster's ATK can't be halved,\nas long as that monster is still on the field when this effect resolves\n(even if it's face-down or was summoned face-down).\n\n● The ATK loss remains even if this card's effect becomes negated or if it leaves the field.\n● If \"Shrink\" is chained to the effect to halve ATK:\nIts original ATK is halved by \"Shrink\", then its halved ATK is halved again, and permanently remains halved.\n● If \"Shrink\" is later used on the monster whose ATK was halved:\nIts ATK becomes half its original ATK, and in the End Phase, its ATK becomes its original (printed) ATK.\n● If \"Forbidden Lance\" is later used on the monster whose ATK was halved:\nIts current ATK is reduced by 800 (until the End Phase), but Garden's halving effect still applies.",
    "Cat": "Error: Text too long.",
    "TeleDAD": "Error: Text too long.",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. The first effect of \"Black Garden\" is a Trigger Effect.\\n2. The second effect of \"Black Garden\" that Special Summons 1 monster from your GY targets.\\n3. Destroying \"Black Garden\" and all face-up Plant-Type monsters is not a cost.\\n4. If a monster Normal or Special Summoned while \"Black Garden\" is active is flipped face-down, its ATK will no longer be halved.\\n5. If a monster is Special Summoned face-down, the first effect of \"Black Garden\" still activates. The monster's ATK is not halved, but a 'Rose Token' is still Special Summoned.\\n6. If the second effect of \"Black Garden\" is activated and an effect is chained that removes it from the field, its effect disappears because it cannot be destroyed, and the face-up Plant-Type monsters on the field are not destroyed.\\n7. If the second effect of \"Black Garden\" is activated and an effect is chained that changes the ATK of Plant-Type monster(s) on the field, the targeted monster in the GY is not Special Summoned, but \"Black Garden\" and all face-up Plant-Type monsters on the field are still destroyed.\\n8. The 'total ATK' of the destroyed Plant-Type monsters is equal to their combined ATK while on the field.\\n9. When a monster is Normal or Special Summoned, any Continuous Effects that increase or decrease the monster's ATK are applied before halving the monster's ATK with the effect of \"Black Garden\". For example, If \"Command Knight\" is Normal or Special Summoned, when \"Black Garden\" halves its ATK it also halves the ATK \"Command Knight\" gained from its effect. If \"Burden of the Mighty\" is active, the monster's reduced ATK is halved by \"Black Garden\".\\n10. If \"Black Garden\" is removed from the field or negated, the ATK of monsters whose ATK was halved remains halved.\\n11. If you control \"Black Garden\", when you activate \"Scapegoat\" the effect of \"Black Garden\" will activate after your 'Sheep Tokens' are Special Summoned, but its effect will disappear. If instead, your opponent activates \"Scapegoat\", after they Special Summon their 'Sheep Tokens' the effect of \"Black Garden\" activates, and when it resolves you will Special Summon the 'Rose Token'.\\n12. If your opponent Normal or Special Summons a monster while you do not have any open Monster Zones, the first effect of \"Black Garden\" still activates and halves the monster's ATK, but the 'Rose Token' is not Special Summoned.\\n13. If you have a Gemini Monster on the field and you Normal Summon it to change it into an Effect Monster, the first effect of \"Black Garden\" activates. It will halve the Gemini Monster's ATK and Special Summon a 'Rose Token' onto your opponent's side of the field. If the Gemini Monster's ATK had already been halved by \"Black Garden\" when it was previously Normal or Special Summoned, it is halved again.\\n14. If \"Vanity's Fiend\" is face-up on the field when a monster is Normal Summoned, the first effect of \"Black Garden\" still activates. The Normal Summoned monster's ATK is halved, but the 'Rose Token' is not Special Summoned.\\n15. If \"Black Garden\" cannot be destroyed (due to \"Field Barrier\", etc.), its second effect cannot be activated.\\n16. If you activate the second effect of \"Black Garden\" and an effect is chained that removes the targeted monster from your GY, \"Black Garden\" and all face-up Plant-Type monsters on the field are still destroyed, but no monster is Special Summoned from your GY.\\n17. When either of the effects of \"Black Garden\" are activated, the effect of \"Royal Oppression\" can be chained.\\n18. If a monster has its ATK halved by \"Black Garden\", and afterwards its original ATK is halved by \"Shrink\", the monster's ATK becomes half its original ATK. When the effect of \"Shrink\" is no longer applied, the monster's ATK returns to its original ATK.\\n19. If a monster has its ATK halved by \"Black Garden\", and afterwards it is equipped with \"Megamorph\", its ATK will be equal to double its original ATK. If \"Megamorph\" is later negated or removed from the field, the monster's ATK will return to half its ATK (the same as it was before \"Megamorph\" was equipped).\\n20. If \"King of the Skull Servants\" is Normal or Special Summoned, first its original ATK is set by its effect. When \"Black Garden\" halves its ATK, it will halve the original ATK, and even if the number of \"King of the Skull Servants\" and/or \"Skull Servant\" in the GY changes afterwards, the ATK of the \"King of the Skull Servants\" remains at the halved value set by \"Black Garden\".\\n21. If \"Tyranno Infinity\" is Normal or Special Summoned, first its original ATK is set by its effect. When \"Black Garden\" halves its ATK, it will halve the original ATK, and even if the number of Dinosaur-Type monsters in its controller's GY changes, the ATK of \"Tyranno Infinity\" remains at the halved value set by \"Black Garden\".\\n22. If \"Black Garden\" and \"The Wicked Dreadroot\" are face-up on the field, when a monster is Normal or Special Summoned its ATK is first halved by \"The Wicked Dreadroot\", and afterwards its ATK is halved again when the effect of \"Black Garden\" resolves.\\n23. If you and your opponent Special Summon monster(s) with the same effect, when the effect of \"Black Garden\" resolves the ATK of each Special Summoned monster is halved, and 1 'Rose Token' is Special Summoned onto both you and your opponent's side of the field. If either player does not have an open Monster Card Zone, their opponent still gets a 'Rose Token'.\\n24. The player that Normal or Special Summoned a monster chooses which of their opponent's Monster Card Zones the 'Rose Token' is Special Summoned into. The player that Normal or Special Summoned a monster is considered to be the 'owner' of the 'Rose Token'.\\n25. If a monster that is unaffected by the effects of Spell Cards is Normal or Special Summoned, its ATK will not be halved by the effect of \"Black Garden\", but the 'Rose Token' is still Special Summoned.\\n26. If a monster that is unaffected by the effects of Spell Cards is also a Plant-Type monster, it is not destroyed when the second effect of \"Black Garden\" resolves, and its ATK is not included in the total ATK of the destroyed Plant-Type monsters.\\n27. If the second effect of \"Black Garden\" is activated and \"Call of the Haunted\" is chained, Special Summoning \"Fossil Dyna Pachycephalo\", the effect of \"Black Garden\" cannot Special Summon a monster, but it and all face-up Plant-Type monsters on the field are still destroyed."
  },
  "PSCT": {
    "Edison": "① If a monster(s) is Normal/Special Summoned (except by “Black Garden”): Halve its ATK, also, if it is still on the field (even if face-down), you Special Summon 1 “Rose Token” (Plant/DARK/Level 2/ATK 800/DEF 800) to that monster's opponent's field, in Attack Position.\n② You can target 1 monster in your GY with ATK equal to the total ATK of all face-up Plants; destroy this card and as many Plants on the field as possible, then, if you destroyed all of them, Special Summon that target.",
    "Tengu": "① If a monster is Normal/Special Summoned (except by “Black Garden”):\nHalve its ATK, also, if it is still on the field, its controller Special Summons 1 “Rose Token” (Plant/DARK/Level 2/ATK 800/DEF 800) to their opponent's field, in Attack Position.\n② You can target 1 monster in your GY with ATK equal to the total ATK of all face-up Plants;\ndestroy this card and as many Plants on the field as possible, then, if you destroyed all of them, Special Summon that target.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "① If a monster is Normal/Special Summoned (except by “Black Garden”):\nHalve its ATK, also, if it is still on the field, you Special Summon 1 “Rose Token” (Plant/DARK/Level 2/ATK 800/DEF 800) to their opponent's field, in Attack Position.\n② You can target 1 monster in your GY with ATK equal to the total ATK of all face-up Plants;\ndestroy this card and as many Plants on the field as possible, then, if you destroyed all of them, Special Summon that target.",
    "Meadowlands": "① If a monster is Normal/Special Summoned (except by “Black Garden”):\nHalve its ATK, also, if it is still on the field, you Special Summon 1 “Rose Token” (Plant/DARK/Level 2/ATK 800/DEF 800) to their opponent's field, in Attack Position.\n② You can target 1 monster in your GY with ATK equal to the total ATK of all face-up Plants;\ndestroy this card and as many Plants on the field as possible, then, if you destroyed all of them, Special Summon that target.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}