{
  "id": 74923978,
  "name": "Forced Requisition",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Continuous"
  },
  "Rulings": {
    "Tengu": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Goat": "●There is a difference between activating “Forced Requisition” (flipping it face-up on the field) and triggering its effect once activated. “Forced Requisition” is similar to “Appropriate” in that you first must activate the card (flip it face-up) when certain conditions are achieved, but activating it does not itself trigger any additional effects. Once “Forced Requisition” is applying (face-up on the field), then after that point the effect of “Forced Requisition” may be triggered. “Forced Requisition” may only be activated (flipped face-up) immediately after discarding from your hand.\n●You can activate (flip face-up) “Forced Requisition” in response to your own “Graceful Charity” because discarding is the last action you performed with “Graceful Charity's” effect. You can activate (flip face-up) “Forced Requisition” when you discard during your End Phase to lower your hand size to 6.\n●You cannot activate (flip face-up) “Forced Requisition” in response to “Morphing Jar” or “Card Destruction” because you draw cards after discarding. You cannot activate (flip face-up) “Forced Requisition” when you discard a card as a cost, such as for “Magic Jammer,” “Type Zero Magic Crusher,” or “Thunder Dragon.” You cannot activate (flip face-up) “Forced Requisition” during the Damage Step when you discard “Kuriboh,” discard for “Spirit Ryu,” or must discard for “White Magical Hat,” etc. If you discard your hand by the effect of “Hino-Kagu-Tsuchi” before drawing in the DP, you cannot activate “Forced Requisiton” because you cannot activate any card before drawing in your DP.\n● Note that costs WILL trigger the effect of “Forced Requisition” once it is applying, even though they cannot be used to activate (flip face-up) the card. Once “Forced Requisition” is applying on your side of the field, only count cards discarded after its activation, and do not count the card that was discarded that allowed you to trigger the activation. Your opponent selects which cards they discard. When there are multiple “Forced Requisitions” applying on the field, their effects are cumulative.\n●Once “Forced Requisition” is applying on your side of the field, its effect is not triggered by “Chain Destruction” because “Chain Destruction” destroys a card.\n●If your opponent discards “Minar” or “Sinister Serpent” because of your “Forced Requisition's” effect, the effects of those cards are applied. But if your opponent discards “Thunder Dragon” because of your “Forced Requisition's” effect, the effect of “Thunder Dragon” is not activated because you must discard “Thunder Dragon” for the specific purpose of activating its effect.\n●”Forced Requisition's” effect is not applied when a card in your hand is removed from play (such as with “Lightforce Sword”).",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg"
  },
  "PSCT": {
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}