{
  "id": 77229910,
  "name": "Morphtronic Forcefield",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Counter"
  },
  "Rulings": {
    "Edison": "●You can chain “Morphtronic Forcefield” to effects that don't target, like “Dark Hole”. You can't chain “Morphtronic Forcefield” to effects that are uncertain to destroy a “Morphtronic” monster like “Fissure” or “Smashing Ground”, even if the only monsters you control are “Morphtronic” monsters. If you don’t have any “Morphtronic” monsters in your Deck, you can't activate “Morphtronic Forcefield”. You can only chain “Morphtronic Forcefield” to a card that destroys a “Morphtronic” monster at resolution, not to a card that will destroy one in the future. So you can't chain it to “Ekibyo Drakmord”, “Blind Destruction”, or “Needle Wall”. You can't activate “Morphtronic Forcefield” if “Thunder King Rai-Oh” is on the field. If an effect is chained to “Morphtronic Forcefield” that Summons “Thunder King Rai-Oh”, you won't be able to add a “Morphtronic” monster to your hand, but “Morphtronic Forcefield” will still negate the Spell or Trap Card that it was chained to.",
    "Tengu": "\n●You can chain “Morphtronic Forcefield” to effects that do not target, like “Dark Hole”. You cannot chain “Morphtronic Forcefield” to effects that are uncertain to destroy a “Morphtronic” monster like “Fissure” or “Smashing Ground”, even if the only monsters you control are “Morphtronic” monsters. If you don’t have any “Morphtronic” monsters in your Deck, you cannot activate “Morphtronic Forcefield”. You can only chain “Morphtronic Forcefield” to a card that destroys a “Morphtronic” monster at resolution, not to a card that will destroy one in the future. So you cannot chain it to “Ekibyo Drakmord”, “Blind Destruction”, or “Needle Wall”. You cannot activate “Morphtronic Forcefield” if “Thunder King Rai-Oh” is on the field. If an effect is chained to “Morphtronic Forcefield” that Summons “Thunder King Rai-Oh”, you will not be able to add a “Morphtronic” monster to your hand, but “Morphtronic Forcefield” will still negate the Spell or Trap Card that it was chained to.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. You can chain \"Morphtronic Forcefield\" to effects that do not target, like \"Dark Hole\".\\n2. You cannot chain \"Morphtronic Forcefield\" to effects that are uncertain to destroy a 'Morphtronic' monster like \"Fissure\" or \"Smashing Ground\", even if the only monsters you control are 'Morphtronic' monsters.\\n3. If you don't have any 'Morphtronic' monsters in your Deck, you cannot activate \"Morphtronic Forcefield\".\\n4. You can only chain \"Morphtronic Forcefield\" to a card that destroys a 'Morphtronic' monster at resolution, not to a card that will destroy one in the future. So you cannot chain it to \"Ekibyo Drakmord\", \"Blind Destruction\", or \"Needle Wall\".\\n5. You cannot activate \"Morphtronic Forcefield\" if \"Thunder King Rai-Oh\" is on the field. If an effect is chained to \"Morphtronic Forcefield\" that Summons \"Thunder King Rai-Oh\", you will not be able to add a 'Morphtronic' monster to your hand, but \"Morphtronic Forcefield\" will still negate the Spell or Trap Card that it was chained to."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}