{
  "id": 80604092,
  "name": "Ultimate Offering",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Continuous"
  },
  "Rulings": {
    "Tengu": "● The summon does not happen \"immediately after this effect resolves\". It can't be negated by \"Solemn Judgment\".\n● You can chain this effect to itself, even if you only have 1 monster in hand.",
    "Goat": "●You may flip Ultimate Offering face-up during any ph 01/6/2004ase of play and during either player's turn. This much is fine. You can only activate its effect of addition normal summons during YOUR MP 1 and 2, and during your OPPONENT'S Battle Phase. This means you could flip it face-up during your opponent's MP 1 and then activate its effect during their Battle Phase. \n●The Summon produced through the effect of “Ultimate Offering” may be negated only if that Summon was the first link of a Chain.\n●The monster chosen by “Ultimate Offering” to be Normal Summoned/Set is chosen at activation of the effect.\nA player may not Tribute a monster to be Summoned by “Ultimate Offering” until that monster is Normal Summoned/Set to the field.\n●Q: If my opponent uses a face-up “Ultimate Offering” to tribute Set a monster when I attack, does this issue a replay? \nA: Yes, because the number of monsters went from down one and then back up one. \n● \n●Q: If I declare an attack and my opponent uses the effect of “Ultimate Offering” to tribute the monster I am attacking for a higher level monster, does my attack continue? \nA: A replay would occur because the target of your attack is no longer on the field. Play will return to the Battle Step. You are not forced to attack the new monster. \n●  \n●Q: If a player has an applying “Ultimate Offering” on the field, can their opponent use the effect? \nA: Only the controller of Ultimate Offering can use its effect. (Search for Ultimate Offering 2 to continue reading)",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● If Ultimate Offering is face-up, you can activate its effect multiple times in the same chain. \n● When you activate Ultimate Offering’s effect, you pay the 500 LP as a cost at activation, and then the Summon occurs at resolution of Ultimate Offering’s effect in that chain. This means that it is possible to Summon a monster in the middle of a chain with Ultimate Offering’s effect. \n● If you are using Ultimate Offering's effect to perform a Tribute Summon, you Tribute the monster when Ultimate Offering's effect RESOLVES and you perform the Tribute Summon, NOT when you activate Ultimate Offering's effect and pay the 500 LP. \n● If your opponent activates a Trap Card, you can chain the effect of your face-up Ultimate Offering to the Trap Card to Tribute Summon Jinzo (if you had a monster on the field to Tribute) and negate the Trap Card’s effect. \n● If you activate Ultimate Offering’s effect to Summon, and your opponent chains Mystical Space Typhoon to destroy Ultimate Offering, the Summon does not resolve because Ultimate Offering is a Continuous Trap Card and is no longer on the field. \n● You can activate the effect of a face-up 'Ultimate Offering' during your Main Phase even if you have not done a Normal Summon yet this turn.",
    "TeleDAD": "● If Ultimate Offering is face-up, you can activate its effect multiple times in the same chain. \n● When you activate Ultimate Offering’s effect, you pay the 500 LP as a cost at activation, and then the Summon occurs at resolution of Ultimate Offering’s effect in that chain. This means that it is possible to Summon a monster in the middle of a chain with Ultimate Offering’s effect. \n● If you are using Ultimate Offering's effect to perform a Tribute Summon, you Tribute the monster when Ultimate Offering's effect RESOLVES and you perform the Tribute Summon, NOT when you activate Ultimate Offering's effect and pay the 500 LP. \n● If your opponent activates a Trap Card, you can chain the effect of your face-up Ultimate Offering to the Trap Card to Tribute Summon Jinzo (if you had a monster on the field to Tribute) and negate the Trap Card’s effect. \n● If you activate Ultimate Offering’s effect to Summon, and your opponent chains Mystical Space Typhoon to destroy Ultimate Offering, the Summon does not resolve because Ultimate Offering is a Continuous Trap Card and is no longer on the field. \n● You can activate the effect of a face-up 'Ultimate Offering' during your Main Phase even if you have not done a Normal Summon yet this turn.",
    "Gladiator": "● If Ultimate Offering is face-up, you can activate its effect multiple times in the same chain. \n● When you activate Ultimate Offering’s effect, you pay the 500 LP as a cost at activation, and then the Summon occurs at resolution of Ultimate Offering’s effect in that chain. This means that it is possible to Summon a monster in the middle of a chain with Ultimate Offering’s effect. \n● If you are using Ultimate Offering's effect to perform a Tribute Summon, you Tribute the monster when Ultimate Offering's effect RESOLVES and you perform the Tribute Summon, NOT when you activate Ultimate Offering's effect and pay the 500 LP. \n● If your opponent activates a Trap Card, you can chain the effect of your face-up Ultimate Offering to the Trap Card to Tribute Summon Jinzo (if you had a monster on the field to Tribute) and negate the Trap Card’s effect. \n● You can't flip Ultimate Offering face-up AND use its effect in the same chain; you must have Ultimate Offering applying before the current chain began. \n● If you activate Ultimate Offering’s effect to Summon, and your opponent chains Mystical Space Typhoon to destroy Ultimate Offering, the Summon does not resolve because Ultimate Offering is a Continuous Trap Card and is no longer on the field. \n● You can activate the effect of a face-up 'Ultimate Offering' during your Main Phase even if you have not done a Normal Summon yet this turn.",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. If \"Ultimate Offering\" is face-up, you can activate its effect multiple times in the same chain.\\n2. When you activate the effect of \"Ultimate Offering\", you pay the 500 Life Points as a cost at activation, and then the Summon occurs at resolution of the effect of \"Ultimate Offering\" in that chain. This means that it is possible to Summon a monster in the middle of a chain with the effect of \"Ultimate Offering\".\\n3. If you are using the effect of \"Ultimate Offering\" to perform a Tribute Summon, you Tribute the monster when the effect of \"Ultimate Offering\" RESOLVES and you perform the Tribute Summon, NOT when you activate the effect of \"Ultimate Offering\" and pay the 500 Life Points.\\n4. If your opponent activates a Trap Card, you can chain the effect of your face-up \"Ultimate Offering\" to the Trap Card to Tribute Summon \"Jinzo\" (if you had a monster on the field to Tribute) and negate the Trap Card's effect.\\n5. If you activate the effect of \"Ultimate Offering\" to Summon, and your opponent chains \"Mystical Space Typhoon\" to destroy \"Ultimate Offering\", the Summon does not resolve because \"Ultimate Offering\" is a Continuous Trap Card and is no longer on the field.\\n6. You can activate the effect of a face-up \"Ultimate Offering\" during your Main Phase even if you have not done a Normal Summon yet this turn."
  },
  "PSCT": {
    "Tengu": "① During your Main Phase or your opponent's Battle Phase: You can pay 500 LP; \nduring this effect's resolution, Normal Summon/Set 1 monster.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}