{
  "id": 81210420,
  "name": "Magical Hats",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Normal"
  },
  "Rulings": {
    "Edison": "Activate only during your opponent's Battle Phase. ●This card can't be activated unless you can Special Summon both cards. You can't activate this card while a Barrier Statue monster restricts you to Summoning monsters of a specific Attribute.\n●This card can activate in the Start Step (before Attack declaration), the Battle Step before [but not during] the Damage Step, and the End Step (before Main Phase 2) of your opponent's Battle Phase.\n●The effect Special Summons 2 non-Monster Cards (they are revealed to the opponent).\n●The Special Summoned Cards don't HAVE Levels, Attributes, or Types.\n●The cards are Special Summoned face-down, even if Gozen Match / Rivalry of Warlords applies.\n●If the Special Summoned cards have Trigger Effects that activate when destroyed (ex: Black Pendant, Geartown, Supervise), they can trigger when destroyed by battle. Cards like Statue of the Wicked & Dark Coffin must be destroyed while face-down (by card effect) in order to activate, they don't activate if flipped by an attack and destroyed by battle.\n●If Light of Intervention is active, the cards are placed in face-up Defense Position.\n●If Gravekeeper's Servant is Summoned and Necrovalley is active, it gains 500 ATK and DEF.\n●After Special Summoning non-Monster Cards, if this effect would flip a Trap Monster (ex: Zoma the Spirit) face-down, it returns to the Spell / Trap Card Zone and is not shuffled face-down with the Special Summoned non-Monster Cards. Once Set, it can't activate that turn.\n●The Condition does not start a chain.\n●This can cause Trigger Effects (ex: Geartown, Dark Coffin) to activate when destroyed.\n●A card removed from play by Interdimensional Matter Transporter is destroyed when it is returns.",
    "Tengu": "Activate only during your opponent's Battle Phase. (1) Select 2 non-Monster Cards from your Deck and 1 monster you control. Shuffle those 3 cards and Set them on the field in face-down Defense Position. (C)The 2 cards selected from your Deck are treated as monsters (ATK 0/DEF 0) and are destroyed at the end of the Battle Phase.\n●This card cannot be activated unless you can Special Summon both cards. You cannot activate this card while a Barrier Statue monster restricts you to Summoning monsters of a specific Attribute.\n●This card can activate in the Start Step (before Attack declaration), the Battle Step before [but not during] the Damage Step, and the End Step (before Main Phase 2) of your opponent's Battle Phase.\n●The (1) effect Special Summons 2 non-Monster Cards (they are revealed to the opponent).\n●The Special Summoned Cards DO NOT HAVE Levels, Attributes, or Types.\n●The cards are Special Summoned face-down, even if Gozen Match / Rivalry of Warlords applies.\n●If the Special Summoned cards have Trigger-like Effects that activate when destroyed (ex: Black Pendant, Geartown, Supervise), they can trigger when destroyed by battle. Cards like Statue of the Wicked & Dark Coffin must be destroyed while face-down (by card effect) in order to activate, they do not activate if flipped by an attack and destroyed by battle.\n●If Light of Intervention is active, the cards are placed in face-up Defense Position.\n●If Gravekeeper's Servant is Summoned and Necrovalley is active, it gains 500 ATK and DEF.\n●After Special Summoning non-Monster Cards, if this effect would flip a Trap Monster (ex: Zoma the Spirit) face-down, it returns to the Spell / Trap Card Zone and is not shuffled face-down with the Special Summoned non-Monster Cards. Once Set, it cannot activate that turn.\n●The (C) Condition does not start a chain.\n●This can cause Trigger-like Effects (ex: Geartown, Dark Coffin) to activate when destroyed.\n●A card removed from play by Interdimensional Matter Transporter is destroyed when it is returns.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● You can't activate 'Magical Hats' if you do not have at least 2 open Monster Card Zones.\n● You must show your opponent the 2 selected Non-Monster Cards before they are Set.\n● If you activate 'Magical Hats' while 'Light of Intervention' is applying, the cards are placed in face-up Defense Position.\n● If you select 'Black Pendant', when it is destroyed during the end of the Battle Phase its effect activates, even if it was face-down.\n● If one of the Non-Monster Cards is removed from play with 'Interdimensional Matter Transporter', it is destroyed when it is returned to the field during the End Phase.\n● If 'Statue of the Wicked' or 'Dark Coffin' are selected and they are destroyed while face-down, their effects activate. If they are flipped by an attack and destroyed, their effects do not activate.",
    "TeleDAD": "● You can't activate 'Magical Hats' if you do not have at least 2 open Monster Card Zones.\n● You must show your opponent the 2 selected Non-Monster Cards before they are Set.\n● If you activate 'Magical Hats' while 'Light of Intervention' is applying, the cards are placed in face-up Defense Position.\n● If you select 'Black Pendant', when it is destroyed during the end of the Battle Phase its effect activates, even if it was face-down.\n● If one of the Non-Monster Cards is removed from play with 'Interdimensional Matter Transporter', it is destroyed when it is returned to the field during the End Phase.\n● If 'Statue of the Wicked' or 'Dark Coffin' are selected and they are destroyed while face-down, their effects activate. If they are flipped by an attack and destroyed, their effects do not activate.",
    "Gladiator": "● You can't activate 'Magical Hats' if you do not have at least 2 open Monster Card Zones.\n● You must show your opponent the 2 selected Non-Monster Cards before they are Set.\n● If you activate 'Magical Hats' while 'Light of Intervention' is applying, the cards are placed in face-up Defense Position.\n● If you select 'Black Pendant', when it is destroyed during the end of the Battle Phase its effect activates, even if it was face-down.\n● If one of the Non-Monster Cards is removed from play with 'Interdimensional Matter Transporter', it is destroyed when it is returned to the field during the End Phase.\n● If 'Statue of the Wicked' or 'Dark Coffin' are selected and they are destroyed while face-down, their effects activate. If they are flipped by an attack and destroyed, their effects do not activate.",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. You cannot activate \"Magical Hats\" if you do not have at least 2 open Monster Card Zones.\\n2. You must show your opponent the 2 selected Non-Monster Cards before they are Special Summoned face-down.\\n3. If you activate \"Magical Hats\" while \"Light of Intervention\" is active, the cards are placed in face-up Defense Position.\\n4. If you select \"Black Pendant\", when it is destroyed during the end of the Battle Phase its effect activates, even if it was face-down.\\n5. If one of the Non-Monster Cards is removed from play with \"Interdimensional Matter Transporter\", it is destroyed when it is returned to the field during the End Phase.\\n6. If \"Statue of the Wicked\" or \"Dark Coffin\" are selected and they are destroyed while face-down, their effects activate. If they are flipped by an attack and destroyed, their effects do not activate."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "During your opponent's Battle Phase: Choose 2 Spell/Trap Cards from your Deck and 1 monster in your Main Monster Zone. Special Summon them as Normal Monsters (ATK 0/DEF 0) in face-down Defense Position, Set the chosen monster if it is face-up, and shuffle them on the field. The 2 cards chosen from your Deck are destroyed at the end of the Battle Phase, and cannot remain on the field except during this Battle Phase."
  }
}