{
  "id": 87910978,
  "name": "Brain Control",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Normal"
  },
  "Rulings": {
    "Edison": "● If that target isn't face-up in your opponent's control when this resolves, control of it does not change.\n● If that monster is later flipped face-down, control still returns during the End Phase.",
    "Tengu": "● If that target isn't face-up in your opponent's control when this resolves, control of it does not change.\n● If that monster is later flipped face-down, control still returns during the End Phase.",
    "Goat": "●If the monster targeted by “Brain Control” is Set later in the turn, it is still returned back to the original controller in the End Phase.\n●You cannot activate “Brain Control” if you already have 5 monsters on your side of the field.\n●If you activate either of Enemy Controller's effects, and your opponent chains Book of Moon to flip the target monster face-down, its targeting conditions are no longer correct when Enemy Controller resolves and Enemy Controller's effect disappears.\n●If the monster affected by “Change of Heart” is temporarily removed from play, that monster will return to the original controller when the monster returns to play.\nA face-up “Blindly Loyal Goblin” may not be targeted by “Change of Heart.” If a face-down “Blindly Loyal Goblin” changes control through the effect of “Change of Heart” or similar cards and “Blindly Loyal Goblin” is turned face-up, control of “Blindly Loyal Goblin” will not return to the original controller.\n●If a monster that changes control via “Change of Heart” is turned face-down by “Book of Moon,” the monster will return to the original controller’s field when the turn ends as normal per “Change of Heart.”\n●If a monster that changes control via “Change of Heart” is temporarily removed from the field via “Dimensionhole” or “Interdimensional Matter Transporter,” that monster will return to the original controller’s control when it returns to the field.\n●Q: If someone were to “Change of Heart” a Monster, then use “Interdimensional Matter Transporter” it to remove it from the field, would it come back to the Person who played “Change of Heart’s” field forever, or go back to the Owners field? \nA: During the End Phase the monster will return to the side of the field of the person who played Change of Heart, but will then return to the previous controller. \n●Q: If the opponent activates “Change of Heart” or “Snatch Steal” with only 3 Monster Zone spaces remaining and you chain with “Ojama Trio”, what will happen to the monster the opponent is trying to take control of? \nA: When they take control of the monster, if there are no longer any open Monster Zone spaces for the taken monster it will be destroyed. \n●Q: Can “Change of Heart” or “Snatch Steal” be activated to destroy an opponent’s monster if all 5 Monster Zone spaces are full or does it only happen during the resolution of a chain? \nA: It is during the resolution of a chain. If you do not have any empty zones in your Monster Zone you cannot activate Change of Heart or Snatch Steal to take control of an opponent's monster.",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "TeleDAD": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "Gladiator": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "ReturnDAD": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "Trooper": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "Circle": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "Stein": "● If the monster targeted by “Brain Control” is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\n● You can't activate “Brain Control” if you already have 5 monsters on your side of the field.",
    "Base": "1. If the monster targeted by \"Brain Control\" is flipped face-down later in the turn, it is still returned back to the original controller in the End Phase.\\n2. You cannot activate \"Brain Control\" if you already have 5 monsters on your side of the field."
  },
  "PSCT": {
    "Edison": "① Pay 800 LP, then target 1 face-up monster your opponent controls; take control of that target (until the End Phase).",
    "Tengu": "① Pay 800 LP, then target 1 face-up monster your opponent controls; \ntake control of that target (until the End Phase).",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}