{
  "id": 90502999,
  "name": "Ground Collapse",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Continuous"
  },
  "Rulings": {
    "Tengu": "\n●When resolving the effect of Cyber Jar or Morphing Jar #2, if you pick up more monsters than you can Special Summon, due to Ground Collapse, the monsters you cannot Special Summon are destroyed. If a Sangan or Witch of the Black Forest is destroyed this way, its effect does not activate.\n●While Ground Collapse's effect is negated, monsters can be Summoned or Set into the selected Monster Card Zones. When Ground Collapse becomes active again, the selected Monster Card Zones cannot be used, but any monster in the selected Monster Card Zones remains there.\n●You cannot select a Monster Card Zone that is already selected by another Ground Collapse.\n●If your opponent takes control of your monster with Brain Control and then activates Ground Collapse, if there are no open Monster Card Zones for the monster to return to in the End Phase, it is destroyed.",
    "Goat": "● Can you select one of each player’s monster zones with “Ground Collapse”? \nA: You may select 1 of your monster zones and 1 of your opponent's monster zones with the same Ground Collapse.   \n●Q: If “Imperial Order” is activated while “Ground Collapse” is targeting two of the opponent’s Monster Zone spaces, will the opponent be allowed to summon monsters in those spaces and what happens to the monsters if “Imperial Order” is removed from the field? \nA: The monster in that monster zone when Imperial Order is negated or leaves play would be fine. When the monster is removed from the monster zone it would become off-limits again. (Due to Ground Collapse) So let's say I have 2 Ground Collapses, each blocking off 2 of my opponent's Monster Zone spaces. They activate Imperial Order, negating the effect of my Ground Collapses. My opponent could then use those Monster Zones again for Setting and Summoning Monsters. If Imperial Order is negated (e.g. Jinzo, Royal Decree) or is removed from the field, any monster my opponent has in one of the affected Monster Zones will be fine. When that monster leaves (it is destroyed, etc.) the affected Monster Zone, my opponent would not be able to Summon or Set any monsters into that affected Monster Zone because my Ground Collapses are in effect again.  ",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● When resolving the effect of 'Cyber Jar' or 'Morphing Jar #2', if you pick up more monsters than you can Special Summon, due to 'Ground Collapse', the monsters you can't Special Summon are destroyed. If a 'Sangan' or 'Witch of the Black Forest' is destroyed this way, its effect does not activate.\n● While 'Ground Collapse's' effect is negated, monsters can be Summoned or Set into the selected Monster Card Zones. When 'Ground Collapse' becomes applying again, the selected Monster Card Zones can't be used, but any monster in the selected Monster Card Zones remains there.\n● You can't select a Monster Card Zone that is already selected by another 'Ground Collapse'.\n● If your opponent takes control of your monster with 'Brain Control' and then activates 'Ground Collapse', if there are no open Monster Card Zones for the monster to return to in the End Phase, it is destroyed.",
    "TeleDAD": "● When resolving the effect of 'Cyber Jar' or 'Morphing Jar #2', if you pick up more monsters than you can Special Summon, due to 'Ground Collapse', the monsters you can't Special Summon are destroyed. If a 'Sangan' or 'Witch of the Black Forest' is destroyed this way, its effect does not activate.\n● While 'Ground Collapse's' effect is negated, monsters can be Summoned or Set into the selected Monster Card Zones. When 'Ground Collapse' becomes applying again, the selected Monster Card Zones can't be used, but any monster in the selected Monster Card Zones remains there.\n● You can't select a Monster Card Zone that is already selected by another 'Ground Collapse'.\n● If your opponent takes control of your monster with 'Brain Control' and then activates 'Ground Collapse', if there are no open Monster Card Zones for the monster to return to in the End Phase, it is destroyed.",
    "Gladiator": "● When resolving the effect of 'Cyber Jar' or 'Morphing Jar #2', if you pick up more monsters than you can Special Summon, due to 'Ground Collapse', the monsters you can't Special Summon are destroyed. If a 'Sangan' or 'Witch of the Black Forest' is destroyed this way, its effect does not activate.\n● While 'Ground Collapse's' effect is negated, monsters can be Summoned or Set into the selected Monster Card Zones. When 'Ground Collapse' becomes applying again, the selected Monster Card Zones can't be used, but any monster in the selected Monster Card Zones remains there.\n● You can't select a Monster Card Zone that is already selected by another 'Ground Collapse'.\n● If your opponent takes control of your monster with 'Brain Control' and then activates 'Ground Collapse', if there are no open Monster Card Zones for the monster to return to in the End Phase, it is destroyed.",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. When resolving the effect of \"Cyber Jar\" or \"Morphing Jar #2\", if you pick up more monsters than you can Special Summon, due to \"Ground Collapse\", the monsters you cannot Special Summon are destroyed. If a \"Sangan\" or \"Witch of the Black Forest\" is destroyed this way, its effect does not activate.\\n2. While the effect of \"Ground Collapse\" is negated, monsters can be Summoned or Set into the selected Monster Card Zones. When \"Ground Collapse\" becomes active again, the selected Monster Card Zones cannot be used, but any monster in the selected Monster Card Zones remains there.\\n3. You cannot select a Monster Card Zone that is already selected by another \"Ground Collapse\".\\n4. If your opponent takes control of your monster with \"Brain Control\" and then activates \"Ground Collapse\", if there are no open Monster Card Zones for the monster to return to in the End Phase, it is destroyed."
  },
  "PSCT": {
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}