{
  "id": 91998119,
  "name": "XYZ-Dragon Cannon",
  "Stats": {
    "type": "Fusion Monster",
    "frameType": "fusion",
    "atk": 2800,
    "def": 2600,
    "level": 8,
    "race": "Machine",
    "attribute": "LIGHT"
  },
  "Rulings": {
    "Edison": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Tengu": "No rulings found for this card. Request new rulings at https://discord.gg/MmEZSNeTdX",
    "Goat": "“XYZ-Dragon Cannon” may only be Special Summoned through its effect. \n●These monsters cannot be Special Summoned EXCEPT by the way described in their text. They cannot be Special Summoned with Monster Reborn, Magical Scientist, etc.\n●You must remove from play the monsters specified; you cannot use Goddess with the Third Eye, etc., because you are not performing a Fusion Summon.\n●You CAN remove a face-down X-Head Cannon, etc., from play to Special Summon on of these monsters from the Fusion Deck.\n●The Special Summoning of these monsters from the Fusion Deck has no Spell Speed and cannot be chained to (but can be negated with Solemn Judgment).“XYZ-Dragon Cannon” may not be Special Summoned from the GY. \n●“XYZ-Dragon Cannon” is never considered properly Fusion Summoned. \n●Fusion substitution monsters may not be used to Special Summon “XYZ-Dragon Cannon.” \n●Face down “X-Head Cannon”, “Y-Dragon Head,” and “Z-Metal Tank” may be removed from play to Special Summon “XYZ-Dragon Cannon”.\n●“De-Fusion” may target “XYZ Dragon Cannon”. “XYZ-Dragon Cannon” will be returned to the Fusion Deck, but no monsters will be Special Summoned.\n●Q: If “X-Head Cannon” and “Z-Metal Tank” are on the field and “Y-Dragon Head” is equipped to “X-Head Cannon” through its effect, can the three cards be removed from play to Special Summon the “XYZ-Dragon Cannon”? \nA: They would need to be monsters at the time you would remove them from play to Special Summon the associated XYZ Fusion monster. \n● \n●Q: If “X-Head Cannon”, “Y-Dragon Head”, and “Z-Metal Tank” are used to attack the opponent, can they be removed from play to Special Summon “XYZ-Dragon Cannon” during the Battle Phase to attack the opponent once again? \nA: You cannot perform the Special Summon of “XYZ Dragon Cannon” (per its instructions) during your Battle Phase. The XZ, XY, YZ, and XYZ can only be Special Summoned by the method written on each respective monster during MP 1 and 2 of your turn only. ",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. XYZ FUSION MONSTERS: The following rules apply to \"XYZ-Dragon Cannon\", \"YZ-Tank Dragon\", \"XY-Dragon Cannon\", and \"XZ-Tank Cannon\".\\n\\nThese monsters cannot be Special Summoned from the Extra Deck except by the method described in their text. So they cannot be Special Summoned by the effect of \"Magical Scientist\" or \"Summoner of Illusions\". They cannot be Special Summoned from the GY even after they have been Special Summoned by the method described in their texts.\\n\\nYou must remove from play the monsters specified; you cannot use \"Goddess with the Third Eye\", etc., because you are not performing a Fusion Summon.\\n\\nYou CAN remove a face-down \"X-Head Cannon\", etc., from play to Special Summon one of these monsters from the Extra Deck.\\n\\nThe Special Summoning of these monsters from the Extra Deck has no Spell Speed and cannot be chained to (but can be negated with \"Solemn Judgment\")."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "\"X-Head Cannon\" + \"Y-Dragon Head\" + \"Z-Metal Tank\"\r\nMust first be Special Summoned (from your Extra Deck) by banishing the above cards you control. (You do not use \"Polymerization\".) Cannot be Special Summoned from the GY. You can discard 1 card, then target 1 card your opponent controls; destroy that target."
  }
}