{
  "id": 95507060,
  "name": "Raging Mad Plants",
  "Stats": {
    "type": "Spell Card",
    "frameType": "spell",
    "race": "Quick-Play"
  },
  "Rulings": {
    "Edison": "●You must have at least 1 Plant-Type monster in your GY in order to activate this card. The ATK increase is locked-in when this card resolves. The ATK increase won't change if the number of Plant-Type monsters in your GY changes after this card resolves. The ATK increase won't apply to Plant-Type monsters Summoned after this card resolves. The effect to destroy all face-up Plant-Type monsters you control will apply to monsters Summoned after this card resolves. You can activate “Raging Mad Plants” during the Damage Step. The effect to destroy all face-up Plant-Type monsters you control does not start a Chain.",
    "Tengu": "\n●You must have at least 1 Plant-Type monster in your GY in order to activate this card. The ATK increase is locked-in when this card resolves. The ATK increase will not change if the number of Plant-Type monsters in your GY changes after this card resolves. The ATK increase will not apply to Plant-Type monsters Summoned after this card resolves. The effect to destroy all face-up Plant-Type monsters you control will apply to monsters Summoned after this card resolves. You can activate “Raging Mad Plants” during the Damage Step. The effect to destroy all face-up Plant-Type monsters you control does not start a Chain.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. You must have at least 1 Plant-Type monster in your GY in order to activate this card.\\n2. The ATK increase is locked-in when this card resolves. The ATK increase will not change if the number of Plant-Type monsters in your GY changes after this card resolves.\\n3. The ATK increase will not apply to Plant-Type monsters Summoned after this card resolves. The effect to destroy all face-up Plant-Type monsters you control will apply to monsters Summoned after this card resolves.\\n4. You can activate \"Raging Mad Plants\" during the Damage Step.\\n5. The effect to destroy all face-up Plant-Type monsters you control does not start a Chain."
  },
  "PSCT": {
    "Edison": "No Edison-Accurate PSCT available for this card.",
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card.",
    "Base": "All Plant-Type monsters you currently control gain 300 ATK for each Plant-Type monster currently in your Graveyard, until the end of this turn. During the End Phase, destroy all Plant-Type monsters you control."
  }
}