{
  "id": 97077563,
  "name": "Call of the Haunted",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Continuous"
  },
  "Rulings": {
    "Tengu": "No rulings currently available.",
    "Goat": "“Call of the Haunted” constitutes a targeting effect.\n●The player using “Call of the Haunted” must declare the monster to be Special Summoned at the time of activation.\n●If the monster Special Summoned by “Call of the Haunted” is sent to the GY, but not destroyed, “Call of the Haunted” remains on the field meaninglessly. \n●If the monster Special Summoned by “Call of the Haunted” is returned to the hand, “Call of the Haunted remains on the field meaninglessly.\n●If the monster Special Summoned by “Call of the Haunted” is Tributed, “Call of the Haunted” remains on the field meaninglessly.\n●If that monster is not in the GY at the time of resolution, “Call of the Haunted” resolves without effect and remains on the field meaninglessly. \n●“Call of the Haunted” may be used to Special Summon a monster from the GY during either player’s Battle Phase. If “Call of the Haunted” is successfully resolved during the opponent’s Battle Phase as a response to an attack declaration, a Replay is triggered. \n●“Call of the Haunted” may not be activated during the Damage Step.”\n●If “Call of the Haunted” is destroyed in a chain to the activation of “Call of the Haunted,” the monster that would be Special Summoned by “Call of the Haunted” is not Special Summoned.\n●“Call of the Haunted” does not equip itself to “Gearfried the Iron Knight.” “Gearfried the Iron Knight” can be successfully summoned by “Call of the Haunted.”\n●“Call of the Haunted” can Special Summon “Jinzo.” If “Call of the Haunted” is destroyed while “Jinzo” is face-up on the field, the monster targeted by “Call of the Haunted” will not be destroyed. If “Jinzo” is Special Summoned by “Call of the Haunted” and “Jinzo” is destroyed, “Call of the Haunted” is destroyed (Continues).",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "● 'Call of the Haunted' targets the Special Summoned monster, when it is selected in the GY and while it is applying.\n● If the monster Special Summoned with 'Call of the Haunted' is returned to its owner's hand by an effect, 'Call of the Haunted' remains on the field meaninglessly.\n● If an effect is chained that removes 'Call of the Haunted' from the field, the selected monster isn't Special Summoned.\n● If 'Royal Decree' is activated after 'Call of the Haunted' has resolved, and later 'Royal Decree' is destroyed, 'Call of the Haunted' continues to target the Special Summoned monster.",
    "TeleDAD": "● 'Call of the Haunted' targets the Special Summoned monster, when it is selected in the GY and while it is applying.\n● If the monster Special Summoned with 'Call of the Haunted' is returned to its owner's hand by an effect, 'Call of the Haunted' remains on the field meaninglessly.\n● If an effect is chained that removes 'Call of the Haunted' from the field, the selected monster isn't Special Summoned.\n● If 'Royal Decree' is activated after 'Call of the Haunted' has resolved, and later 'Royal Decree' is destroyed, 'Call of the Haunted' continues to target the Special Summoned monster.",
    "Gladiator": "● 'Call of the Haunted' targets the Special Summoned monster, when it is selected in the GY and while it is applying.\n● If the monster Special Summoned with 'Call of the Haunted' is returned to its owner's hand by an effect, 'Call of the Haunted' remains on the field meaninglessly.\n● If an effect is chained that removes 'Call of the Haunted' from the field, the selected monster isn't Special Summoned.\n● If 'Royal Decree' is activated after 'Call of the Haunted' has resolved, and later 'Royal Decree' is destroyed, 'Call of the Haunted' continues to target the Special Summoned monster.",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. \"Call of the Haunted\" targets the Special Summoned monster, when it is selected in the GY and while it is face-up on the field.\\n2. If the monster Special Summoned with \"Call of the Haunted\" is returned to its owner's hand by an effect, \"Call of the Haunted\" remains on the field meaninglessly.\\n3. If an effect is chained that removes \"Call of the Haunted\" from the field, the selected monster is not Special Summoned.\\n4. If \"Royal Decree\" is activated after \"Call of the Haunted\" has resolved, and later \"Royal Decree\" is destroyed, \"Call of the Haunted\" continues to target the Special Summoned monster.\\n5. [FORUM] If a monster that was Special Summoned by \"Call of the Haunted\" is flipped face-down, it is no longer affected by the effect of \"Call of the Haunted\".\\n\\nEXAMPLE 1: If \"Mystical Space Typhoon\" targets \"Call of Haunted\" and \"Book of Moon\" is chained to flip the summoned monster face-down, the monster will not be destroyed when \"Call of the Haunted\" is destroyed by \"Mystical Space Typhoon\".\\n\\nEXAMPLE 2: If the monster summoned by \"Call of the Haunted\" is flipped face-down, then flip summoned and \"Torrential Tribute\" is used in response to the summon, \"Call of the Haunted\" will not be destroyed when the monster is destroyed by \"Torrential Tribute\".\\n6. [FORUM] \"Call of the Haunted\" is a Continuous Trap Card. It must remain face-up on the field for its effect to resolve. If \"Mystical Space Typhoon\" is chained to the activation of \"Call of the Haunted\" and targets it, \"Mystical Space Typhoon\" destroys \"Call of the Haunted\" before it has a chance to resolve so the Monster is never Special Summoned."
  },
  "PSCT": {
    "Tengu": "① Activate this card by targeting 1 monster in your GY; Special Summon that target in Attack Position. \n② When this card leaves the field, destroy that target. \n③ When that target is destroyed, destroy this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}