{
  "id": 97811903,
  "name": "Clear Vice Dragon",
  "Stats": {
    "type": "Effect Monster",
    "frameType": "effect",
    "atk": 0,
    "def": 0,
    "level": 8,
    "race": "Dragon",
    "attribute": "DARK"
  },
  "Rulings": {
    "Tengu": "(1) You are unaffected by the effects of Clear World. (2) If this card attacks an opponent's monster, the ATK of this card becomes twice the ATK of the attack target, during damage calculation only. (3) If this card would be destroyed by an opponent's card effect, you can discard 1 card instead.\n●The (1) Continuous Effect does not activate.\n●VS. Clear World: If you control Clear Vice Dragon and any EARTH, FIRE, or WATER monsters, the effect of Clear World will start a Chain but it will resolve without effect.\n●The (2) Continuous Effect begins to apply during Substep 1 - Start of the Damage Step.\n●If an opponent activates the effect of “Honest” when “Clear Vice Dragon” battles their LIGHT monster, “Clear Vice Dragon’s” ATK will become twice the boosted ATK of the opponent’s monster.\n●If this card attacks “The Wicked Avatar” its ATK will become double that of “The Wicked Avatar” then “The Wicked Avatar” would become this card’s ATK plus 100. No further change will occur.\n●The (3) Continuous Effect applies while resolving an opponent's effect that would destroy this card.\n●Discarding a card is an effect, not a cost (this can trigger the effects of “Dark World” monsters).\n●You choose which card you want to discard to prevent this card’s destruction.\n●This effect only substitutes this card's destruction. It does not negate the opponent's card effect.\n●If your opponent's Monster’s effect would destroy this card and you Chain an effect to take control of that monster, you can still discard 1 card to prevent this card's destruction.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. Discarding a card is an effect, not a cost. You can activate the effects of 'Dark World' monsters discarded by this effect.\\n2. If this card attacks \"The Wicked Avatar\" its ATK will become double that of \"The Wicked Avatar\" then \"The Wicked Avatar\" would become this card's ATK plus 100. No further change will occur.\\n3. If your opponent activates an Effect Monster's effect to destroy this card and you Chain an effect to take control of their monster, you can still discard 1 card from your hand to prevent this card from being destroyed by the effect.\\n4. You choose which card you want to discard to prevent this card's destruction.\\n5. If an opponent activates the effect of \"Honest\" when \"Clear Vice Dragon\" battles their LIGHT monster, the ATK of \"Clear Vice Dragon\" will become twice the boosted ATK of the opponent's monster."
  },
  "PSCT": {
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}