{
  "id": 9995766,
  "name": "Imperial Custom",
  "Stats": {
    "type": "Trap Card",
    "frameType": "trap",
    "race": "Continuous"
  },
  "Rulings": {
    "Tengu": "(1) Face-up Continuous Trap Cards cannot be destroyed, except Imperial Custom. You can only control 1 Imperial Custom.\n●The (1) Continuous-like Effect does not activate.\n●This effect only protects Continuous Traps from destruction.\n●Continuous Traps which destroy themselves (ex: Call of the Haunted) are not destroyed.\n●Continuous Traps still destroy themselves if maintenance costs are not paid (ex: Mirror Wall).\n●Trap Monsters (ex: Zoma the Spirit) can't be destroyed by battle or card effect.\n●If Heavy Storm would destroy face-up Continous Trap Cards, Imperial Custom is destroyed but all other face-up Continuous Trap Cards (including your opponent's) remain.\n●Continuous Trap Cards can still:\n●be flipped face-down (a Trap Monster targeted by Book of Moon).\n●be returned to the Deck (by Raiza the Storm Monarch).\n●be returned to the hand (by Giant Trunade).\n●be removed from play (by Caius the Shadow Monarch).\n●have their effects negated (by Jinzo).\n●have their activation (playing face-up) negated (by Dark Bribe). If the activation of a Continuous Trap Card is negated, it is sent to the GY. It was never face-up on the field.",
    "Goat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "HAT": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Vegas": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Meadowlands": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "FireWater": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Cat": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "TeleDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Gladiator": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "ReturnDAD": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Trooper": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Circle": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Stein": "No rulings found for this card. Request new rulings at https://discord.gg/shVJnYJNpg",
    "Base": "1. If \"Shadow Spell\" targets \"Obsidian Dragon\" while \"Imperial Custom\" is face-up on the field, \"Shadow Spell\" will not be destroyed, but its effects will be negated. If \"Imperial Custom\" is later removed from the field, \"Shadow Spell\" will be destroyed by the effect of \"Obsidian Dragon\".\\n2. If \"Depth Amulet\" would be destroyed by its own effect while \"Imperial Custom\" is face-up on the field, it will not be destroyed and you can continue to use its effect.\\n3. If you do not pay the maintenance cost for \"Mirror Wall\" or \"Imperial Order\" while \"Imperial Custom\" is face-up on the field, those cards will still be destroyed.\\n4. If you control \"Sealmaster Meisei\" and \"Talisman of Spell Sealing\" while \"Imperial Custom\" is face-up on the field and \"Sealmaster Meisei\" is removed from the field, \"Talisman of Spell Sealing\" will not be destroyed and will remain active.\\n5. If \"Overdoom Line\" would be destroyed in the 2 End Phase after its activation while \"Imperial Custom\" is face-up on the field, \"Overdoom Line\" will not be destroyed and its effects will remain active.\\n6. If \"Embodiment of Apophis\" is being treated as a monster while \"Imperial Custom\" is active, it cannot be destroyed by effects or battle.\\n7. If your opponent forces you to activate a 2 \"Imperial Custom\" with \"Bait Doll\" while you already have 1 \"Imperial Custom\" face-up, the activation timing is incorrect and the Set \"Imperial Custom\" is destroyed."
  },
  "PSCT": {
    "Tengu": "No updated text available for this card.",
    "Goat": "No updated text available for this card.",
    "HAT": "No updated text available for this card.",
    "Vegas": "No updated text available for this card.",
    "Meadowlands": "No updated text available for this card.",
    "FireWater": "No updated text available for this card.",
    "Cat": "No updated text available for this card.",
    "TeleDAD": "No updated text available for this card.",
    "Gladiator": "No updated text available for this card.",
    "ReturnDAD": "No updated text available for this card.",
    "Trooper": "No updated text available for this card.",
    "Circle": "No updated text available for this card.",
    "Stein": "No updated text available for this card."
  }
}